module('XML_music_pre', package.seeall)

effect = {
	[615] = {
		["item_list"] = {
			[1] = 110303,
			[2] = 110313,
			[3] = 110342,
		},
		["sentence_content"] = "张开双臂，试图再度拥抱_",
		["sentence_id"] = 615,
		["prompt"] = {
			[1] = "梦想",
			[2] = "夜色",
			[3] = "彩票",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[623] = {
		["item_list"] = {
			[1] = 110303,
			[2] = 110308,
			[3] = 110339,
		},
		["sentence_content"] = "无论_多么遥远，我都不再害怕",
		["sentence_id"] = 623,
		["prompt"] = {
			[1] = "梦想",
			[2] = "远方",
			[3] = "低保",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[512] = {
		["item_list"] = {
			[1] = 110303,
			[2] = 110312,
			[3] = 110327,
		},
		["sentence_content"] = "_与光融为一体",
		["sentence_id"] = 512,
		["prompt"] = {
			[1] = "梦想",
			[2] = "可爱",
			[3] = "御姐",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[401] = {
		["item_list"] = {
			[1] = 110305,
			[2] = 110336,
			[3] = 110310,
		},
		["sentence_content"] = "即使雨天也阻挡不了出门的_",
		["sentence_id"] = 401,
		["prompt"] = {
			[1] = "心情",
			[2] = "萝莉",
			[3] = "勇气",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[413] = {
		["item_list"] = {
			[1] = 110301,
			[2] = 110306,
			[3] = 110327,
		},
		["sentence_content"] = "带着_的希冀",
		["sentence_id"] = 413,
		["prompt"] = {
			[1] = "我们",
			[2] = "旅途",
			[3] = "御姐",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[421] = {
		["item_list"] = {
			[1] = 110301,
			[2] = 110315,
			[3] = 110328,
		},
		["sentence_content"] = "_从此走上各自的道路",
		["sentence_id"] = 421,
		["prompt"] = {
			[1] = "我们",
			[2] = "友情",
			[3] = "计划",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[302] = {
		["item_list"] = {
			[1] = 110305,
			[2] = 110334,
			[3] = 110320,
		},
		["sentence_content"] = "高兴的_也是如此美妙",
		["sentence_id"] = 302,
		["prompt"] = {
			[1] = "心情",
			[2] = "劈叉",
			[3] = "少女",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[616] = {
		["item_list"] = {
			[1] = 110302,
			[2] = 110310,
			[3] = 110336,
		},
		["sentence_content"] = "向着_展翅，再度化作光",
		["sentence_id"] = 616,
		["prompt"] = {
			[1] = "繁星",
			[2] = "勇气",
			[3] = "萝莉",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[624] = {
		["item_list"] = {
			[1] = 110301,
			[2] = 110330,
			[3] = 110321,
		},
		["sentence_content"] = "_即使远离，却不再孤独",
		["sentence_id"] = 624,
		["prompt"] = {
			[1] = "我们",
			[2] = "泳装",
			[3] = "阳光",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[322] = {
		["item_list"] = {
			[1] = 110301,
			[2] = 110317,
			[3] = 110331,
		},
		["sentence_content"] = "但现实中的_",
		["sentence_id"] = 322,
		["prompt"] = {
			[1] = "我们",
			[2] = "太阳",
			[3] = "狗粮",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[521] = {
		["item_list"] = {
			[1] = 110301,
			[2] = 110335,
			[3] = 110320,
		},
		["sentence_content"] = "曾经_满怀欢笑，度过无数快乐时光",
		["sentence_id"] = 521,
		["prompt"] = {
			[1] = "我们",
			[2] = "兄贵",
			[3] = "少女",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[545] = {
		["item_list"] = {
			[1] = 110310,
			[2] = 110321,
			[3] = 110343,
		},
		["sentence_content"] = "松开的瞬间，便抽走所有_",
		["sentence_id"] = 545,
		["prompt"] = {
			[1] = "勇气",
			[2] = "阳光",
			[3] = "贫穷",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[601] = {
		["item_list"] = {
			[1] = 110304,
			[2] = 110307,
			[3] = 110331,
		},
		["sentence_content"] = "被爱的_所充溢",
		["sentence_id"] = 601,
		["prompt"] = {
			[1] = "颜色",
			[2] = "彩虹",
			[3] = "狗粮",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[501] = {
		["item_list"] = {
			[1] = 110302,
			[2] = 110320,
			[3] = 110335,
		},
		["sentence_content"] = "商店街，河提边，_的夜空",
		["sentence_id"] = 501,
		["prompt"] = {
			[1] = "繁星",
			[2] = "少女",
			[3] = "兄贵",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[625] = {
		["item_list"] = {
			[1] = 110303,
			[2] = 110325,
			[3] = 110340,
		},
		["sentence_content"] = "旋转木马，从_中挣脱",
		["sentence_id"] = 625,
		["prompt"] = {
			[1] = "梦想",
			[2] = "追寻",
			[3] = "天台",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[514] = {
		["item_list"] = {
			[1] = 110313,
			[2] = 110331,
			[3] = 110318,
		},
		["sentence_content"] = "坠落在遍体鳞伤的_里",
		["sentence_id"] = 514,
		["prompt"] = {
			[1] = "夜色",
			[2] = "狗粮",
			[3] = "喜欢",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[522] = {
		["item_list"] = {
			[1] = 110306,
			[2] = 110328,
			[3] = 110344,
		},
		["sentence_content"] = "如今踏上了各自的_，渐行渐远",
		["sentence_id"] = 522,
		["prompt"] = {
			[1] = "旅途",
			[2] = "计划",
			[3] = "氪金",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[402] = {
		["item_list"] = {
			[1] = 110304,
			[2] = 110323,
			[3] = 110333,
		},
		["sentence_content"] = "没有_的伞，在你手中展开",
		["sentence_id"] = 402,
		["prompt"] = {
			[1] = "颜色",
			[2] = "用途",
			[3] = "异味",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[414] = {
		["item_list"] = {
			[1] = 110302,
			[2] = 110310,
			[3] = 110335,
		},
		["sentence_content"] = "划破天空，追着_飞去",
		["sentence_id"] = 414,
		["prompt"] = {
			[1] = "繁星",
			[2] = "勇气",
			[3] = "兄贵",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[422] = {
		["item_list"] = {
			[1] = 110306,
			[2] = 110315,
			[3] = 110318,
		},
		["sentence_content"] = "看不见终点的_，十分漫长",
		["sentence_id"] = 422,
		["prompt"] = {
			[1] = "旅途",
			[2] = "友情",
			[3] = "喜欢",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[602] = {
		["item_list"] = {
			[1] = 110317,
			[2] = 110320,
			[3] = 110335,
		},
		["sentence_content"] = "流云的缝隙间，_展露笑容",
		["sentence_id"] = 602,
		["prompt"] = {
			[1] = "太阳",
			[2] = "少女",
			[3] = "兄贵",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[311] = {
		["item_list"] = {
			[1] = 110316,
			[2] = 110336,
			[3] = 110311,
		},
		["sentence_content"] = "坚定预感，紧握_",
		["sentence_id"] = 311,
		["prompt"] = {
			[1] = "双手",
			[2] = "萝莉",
			[3] = "力量",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[626] = {
		["item_list"] = {
			[1] = 110308,
			[2] = 110340,
			[3] = 110319,
		},
		["sentence_content"] = "承载着我，奔向_",
		["sentence_id"] = 626,
		["prompt"] = {
			[1] = "远方",
			[2] = "天台",
			[3] = "黑暗",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[323] = {
		["item_list"] = {
			[1] = 110302,
			[2] = 110329,
			[3] = 110343,
		},
		["sentence_content"] = "已经找到了点缀彼此的_",
		["sentence_id"] = 323,
		["prompt"] = {
			[1] = "繁星",
			[2] = "翅膀",
			[3] = "贫穷",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[523] = {
		["item_list"] = {
			[1] = 110304,
			[2] = 110341,
			[3] = 110305,
		},
		["sentence_content"] = "彼此身上的_，已然格格不入",
		["sentence_id"] = 523,
		["prompt"] = {
			[1] = "颜色",
			[2] = "钱财",
			[3] = "心情",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[603] = {
		["item_list"] = {
			[1] = 110307,
			[2] = 110321,
			[3] = 110341,
		},
		["sentence_content"] = "沿着_攀爬，乘坐积雨云",
		["sentence_id"] = 603,
		["prompt"] = {
			[1] = "彩虹",
			[2] = "阳光",
			[3] = "钱财",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[611] = {
		["item_list"] = {
			[1] = 110304,
			[2] = 110329,
			[3] = 110326,
		},
		["sentence_content"] = "摇曳的舞蝶，涂抹着命运的_",
		["sentence_id"] = 611,
		["prompt"] = {
			[1] = "颜色",
			[2] = "翅膀",
			[3] = "鸡汤",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[502] = {
		["item_list"] = {
			[1] = 110305,
			[2] = 110332,
			[3] = 110330,
		},
		["sentence_content"] = "悸动的_，轻跃的淑女鞋",
		["sentence_id"] = 502,
		["prompt"] = {
			[1] = "心情",
			[2] = "加班",
			[3] = "泳装",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[643] = {
		["item_list"] = {
			[1] = 110316,
			[2] = 110335,
			[3] = 110315,
		},
		["sentence_content"] = "启程时，你我_紧握",
		["sentence_id"] = 643,
		["prompt"] = {
			[1] = "双手",
			[2] = "兄贵",
			[3] = "友情",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[524] = {
		["item_list"] = {
			[1] = 110304,
			[2] = 110333,
			[3] = 110314,
		},
		["sentence_content"] = "四季变换间，只有夕阳的_不改",
		["sentence_id"] = 524,
		["prompt"] = {
			[1] = "颜色",
			[2] = "异味",
			[3] = "孤独",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[403] = {
		["item_list"] = {
			[1] = 110309,
			[2] = 110322,
			[3] = 110331,
		},
		["sentence_content"] = "零碎的_，打湿了一侧的肩膀",
		["sentence_id"] = 403,
		["prompt"] = {
			[1] = "雨滴",
			[2] = "冰雹",
			[3] = "狗粮",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[411] = {
		["item_list"] = {
			[1] = 110311,
			[2] = 110321,
			[3] = 110343,
		},
		["sentence_content"] = "当纯真化作最纯粹的_",
		["sentence_id"] = 411,
		["prompt"] = {
			[1] = "力量",
			[2] = "阳光",
			[3] = "贫穷",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[423] = {
		["item_list"] = {
			[1] = 110310,
			[2] = 110332,
			[3] = 110312,
		},
		["sentence_content"] = "即便不断逞强，炫耀着_",
		["sentence_id"] = 423,
		["prompt"] = {
			[1] = "勇气",
			[2] = "加班",
			[3] = "可爱",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[604] = {
		["item_list"] = {
			[1] = 110304,
			[2] = 110333,
			[3] = 110313,
		},
		["sentence_content"] = "天空的_是如此的迷人",
		["sentence_id"] = 604,
		["prompt"] = {
			[1] = "颜色",
			[2] = "异味",
			[3] = "夜色",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[612] = {
		["item_list"] = {
			[1] = 110303,
			[2] = 110339,
			[3] = 110326,
		},
		["sentence_content"] = "依附着_而活，却与现实背道而驰",
		["sentence_id"] = 612,
		["prompt"] = {
			[1] = "梦想",
			[2] = "低保",
			[3] = "鸡汤",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[312] = {
		["item_list"] = {
			[1] = 110302,
			[2] = 110311,
			[3] = 110320,
		},
		["sentence_content"] = "即便_遥不可及",
		["sentence_id"] = 312,
		["prompt"] = {
			[1] = "繁星",
			[2] = "力量",
			[3] = "少女",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[443] = {
		["item_list"] = {
			[1] = 110313,
			[2] = 110334,
			[3] = 110340,
		},
		["sentence_content"] = "在_之中下坠",
		["sentence_id"] = 443,
		["prompt"] = {
			[1] = "夜色",
			[2] = "劈叉",
			[3] = "天台",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[644] = {
		["item_list"] = {
			[1] = 110308,
			[2] = 110317,
			[3] = 110339,
		},
		["sentence_content"] = "离别时，你我的_已在相反方向",
		["sentence_id"] = 644,
		["prompt"] = {
			[1] = "远方",
			[2] = "太阳",
			[3] = "低保",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[525] = {
		["item_list"] = {
			[1] = 110315,
			[2] = 110306,
			[3] = 110332,
		},
		["sentence_content"] = "静待黄昏后，_依旧",
		["sentence_id"] = 525,
		["prompt"] = {
			[1] = "友情",
			[2] = "旅途",
			[3] = "加班",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[541] = {
		["item_list"] = {
			[1] = 110313,
			[2] = 110342,
			[3] = 110320,
		},
		["sentence_content"] = "六月的谎言，如同眼前的_",
		["sentence_id"] = 541,
		["prompt"] = {
			[1] = "夜色",
			[2] = "彩票",
			[3] = "少女",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[605] = {
		["item_list"] = {
			[1] = 110301,
			[2] = 110342,
			[3] = 110314,
		},
		["sentence_content"] = "_随着风远走高飞",
		["sentence_id"] = 605,
		["prompt"] = {
			[1] = "我们",
			[2] = "彩票",
			[3] = "孤独",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[613] = {
		["item_list"] = {
			[1] = 110302,
			[2] = 110333,
			[3] = 110318,
		},
		["sentence_content"] = "遮蔽_，因为不想重蹈覆辙",
		["sentence_id"] = 613,
		["prompt"] = {
			[1] = "繁星",
			[2] = "异味",
			[3] = "喜欢",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[621] = {
		["item_list"] = {
			[1] = 110304,
			[2] = 110333,
			[3] = 110314,
		},
		["sentence_content"] = "你的天空，如今是何种_",
		["sentence_id"] = 621,
		["prompt"] = {
			[1] = "颜色",
			[2] = "异味",
			[3] = "孤独",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[544] = {
		["item_list"] = {
			[1] = 110318,
			[2] = 110331,
			[3] = 110321,
		},
		["sentence_content"] = "只是_的残留",
		["sentence_id"] = 544,
		["prompt"] = {
			[1] = "喜欢",
			[2] = "狗粮",
			[3] = "阳光",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[511] = {
		["item_list"] = {
			[1] = 110319,
			[2] = 110315,
			[3] = 110313,
		},
		["sentence_content"] = "将迎面而来的_驱散",
		["sentence_id"] = 511,
		["prompt"] = {
			[1] = "黑暗",
			[2] = "友情",
			[3] = "夜色",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[645] = {
		["item_list"] = {
			[1] = 110311,
			[2] = 110307,
			[3] = 110326,
		},
		["sentence_content"] = "失去或得到的，都将化作_",
		["sentence_id"] = 645,
		["prompt"] = {
			[1] = "力量",
			[2] = "彩虹",
			[3] = "鸡汤",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[642] = {
		["item_list"] = {
			[1] = 110315,
			[2] = 110331,
			[3] = 110319,
		},
		["sentence_content"] = "墙壁涂鸦，_童话",
		["sentence_id"] = 642,
		["prompt"] = {
			[1] = "友情",
			[2] = "狗粮",
			[3] = "黑暗",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[641] = {
		["item_list"] = {
			[1] = 110305,
			[2] = 110318,
			[3] = 110334,
		},
		["sentence_content"] = "不愿察觉你故作淡然的_",
		["sentence_id"] = 641,
		["prompt"] = {
			[1] = "心情",
			[2] = "喜欢",
			[3] = "劈叉",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[542] = {
		["item_list"] = {
			[1] = 110314,
			[2] = 110312,
			[3] = 110343,
		},
		["sentence_content"] = "在一片深褐之中，渗透着_",
		["sentence_id"] = 542,
		["prompt"] = {
			[1] = "孤独",
			[2] = "可爱",
			[3] = "贫穷",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[404] = {
		["item_list"] = {
			[1] = 110318,
			[2] = 110344,
			[3] = 110325,
		},
		["sentence_content"] = "你的侧脸，是我_的一部分",
		["sentence_id"] = 404,
		["prompt"] = {
			[1] = "喜欢",
			[2] = "氪金",
			[3] = "追寻",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[442] = {
		["item_list"] = {
			[1] = 110309,
			[2] = 110328,
			[3] = 110343,
		},
		["sentence_content"] = "如同这无声的_",
		["sentence_id"] = 442,
		["prompt"] = {
			[1] = "雨滴",
			[2] = "计划",
			[3] = "贫穷",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[412] = {
		["item_list"] = {
			[1] = 110303,
			[2] = 110338,
			[3] = 110307,
		},
		["sentence_content"] = "为世界创造_",
		["sentence_id"] = 412,
		["prompt"] = {
			[1] = "梦想",
			[2] = "罚单",
			[3] = "彩虹",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[513] = {
		["item_list"] = {
			[1] = 110302,
			[2] = 110336,
			[3] = 110311,
		},
		["sentence_content"] = "却与_的轨道擦身而过",
		["sentence_id"] = 513,
		["prompt"] = {
			[1] = "繁星",
			[2] = "萝莉",
			[3] = "力量",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[515] = {
		["item_list"] = {
			[1] = 110308,
			[2] = 110313,
			[3] = 110334,
		},
		["sentence_content"] = "在_大地上再次结茧，静待重生",
		["sentence_id"] = 515,
		["prompt"] = {
			[1] = "远方",
			[2] = "夜色",
			[3] = "劈叉",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[424] = {
		["item_list"] = {
			[1] = 110314,
			[2] = 110308,
			[3] = 110332,
		},
		["sentence_content"] = "也无法驱散_的阴霾",
		["sentence_id"] = 424,
		["prompt"] = {
			[1] = "孤独",
			[2] = "远方",
			[3] = "加班",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[301] = {
		["item_list"] = {
			[1] = 110304,
			[2] = 110323,
			[3] = 110333,
		},
		["sentence_content"] = "眼泪的_不只有一种",
		["sentence_id"] = 301,
		["prompt"] = {
			[1] = "颜色",
			[2] = "用途",
			[3] = "异味",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[606] = {
		["item_list"] = {
			[1] = 110312,
			[2] = 110314,
			[3] = 110327,
		},
		["sentence_content"] = "你的一切都如此_",
		["sentence_id"] = 606,
		["prompt"] = {
			[1] = "可爱",
			[2] = "孤独",
			[3] = "御姐",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[614] = {
		["item_list"] = {
			[1] = 110302,
			[2] = 110334,
			[3] = 110327,
		},
		["sentence_content"] = "向往_，只因希望成为你",
		["sentence_id"] = 614,
		["prompt"] = {
			[1] = "繁星",
			[2] = "劈叉",
			[3] = "御姐",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[622] = {
		["item_list"] = {
			[1] = 110307,
			[2] = 110338,
			[3] = 110312,
		},
		["sentence_content"] = "我的眼前高挂着_",
		["sentence_id"] = 622,
		["prompt"] = {
			[1] = "彩虹",
			[2] = "罚单",
			[3] = "可爱",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[444] = {
		["item_list"] = {
			[1] = 110310,
			[2] = 110341,
			[3] = 110328,
		},
		["sentence_content"] = "却没有呼唤的_",
		["sentence_id"] = 444,
		["prompt"] = {
			[1] = "勇气",
			[2] = "钱财",
			[3] = "计划",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[321] = {
		["item_list"] = {
			[1] = 110303,
			[2] = 110332,
			[3] = 110310,
		},
		["sentence_content"] = "旋转木马，依旧在_中奔跑",
		["sentence_id"] = 321,
		["prompt"] = {
			[1] = "梦想",
			[2] = "加班",
			[3] = "勇气",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[646] = {
		["item_list"] = {
			[1] = 110306,
			[2] = 110328,
			[3] = 110324,
		},
		["sentence_content"] = "_有你，便是幸运",
		["sentence_id"] = 646,
		["prompt"] = {
			[1] = "旅途",
			[2] = "计划",
			[3] = "考试",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[313] = {
		["item_list"] = {
			[1] = 110301,
			[2] = 110334,
			[3] = 110316,
		},
		["sentence_content"] = "_依旧要勇敢追寻",
		["sentence_id"] = 313,
		["prompt"] = {
			[1] = "我们",
			[2] = "劈叉",
			[3] = "双手",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[303] = {
		["item_list"] = {
			[1] = 110309,
			[2] = 110331,
			[3] = 110322,
		},
		["sentence_content"] = "化作_，润化心灵",
		["sentence_id"] = 303,
		["prompt"] = {
			[1] = "雨滴",
			[2] = "狗粮",
			[3] = "冰雹",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[543] = {
		["item_list"] = {
			[1] = 110316,
			[2] = 110335,
			[3] = 110329,
		},
		["sentence_content"] = "交握的_，并非温存",
		["sentence_id"] = 543,
		["prompt"] = {
			[1] = "双手",
			[2] = "兄贵",
			[3] = "翅膀",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[503] = {
		["item_list"] = {
			[1] = 110301,
			[2] = 110335,
			[3] = 110324,
		},
		["sentence_content"] = "匆忙追赶的每天，_距离渐近",
		["sentence_id"] = 503,
		["prompt"] = {
			[1] = "我们",
			[2] = "兄贵",
			[3] = "考试",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[504] = {
		["item_list"] = {
			[1] = 110305,
			[2] = 110337,
			[3] = 110324,
		},
		["sentence_content"] = "跟_的暴风雨争斗，不知所措",
		["sentence_id"] = 504,
		["prompt"] = {
			[1] = "心情",
			[2] = "挂科",
			[3] = "考试",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
			[3] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
		},
	},
	[505] = {
		["item_list"] = {
			[1] = 110303,
			[2] = 110321,
			[3] = 110337,
		},
		["sentence_content"] = "直到一天，_的一刻突然袭来。",
		["sentence_id"] = 505,
		["prompt"] = {
			[1] = "梦想",
			[2] = "阳光",
			[3] = "挂科",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
	[441] = {
		["item_list"] = {
			[1] = 110314,
			[2] = 110319,
			[3] = 110343,
		},
		["sentence_content"] = "你的身影如此_",
		["sentence_id"] = 441,
		["prompt"] = {
			[1] = "孤独",
			[2] = "黑暗",
			[3] = "贫穷",
		},
		["best"] = 1,
		["item_effect"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
			[2] = {
				[1] = 7,
				[2] = 2,
				[3] = 2,
			},
			[3] = {
				[1] = 5,
				[2] = 3,
				[3] = 3,
			},
		},
	},
}

song = {
	[61] = {
		["sentences_pool"] = {
			[1] = 601,
			[2] = 602,
			[3] = 603,
			[4] = 604,
			[5] = 605,
			[6] = 606,
		},
		["total"] = 60,
		["anctionName"] = "sing_02_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/daily",
		["song_id"] = 61,
		["num"] = 6,
	},
	[33] = {
		["sentences_pool"] = {
			[1] = 321,
			[2] = 322,
			[3] = 323,
		},
		["total"] = 30,
		["anctionName"] = "sing_04_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_2",
		["song_id"] = 33,
		["num"] = 3,
	},
	[52] = {
		["sentences_pool"] = {
			[1] = 511,
			[2] = 512,
			[3] = 513,
			[4] = 514,
			[5] = 515,
		},
		["total"] = 50,
		["anctionName"] = "sing_01_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_1",
		["song_id"] = 52,
		["num"] = 5,
	},
	[54] = {
		["sentences_pool"] = {
			[1] = 541,
			[2] = 542,
			[3] = 543,
			[4] = 544,
			[5] = 545,
		},
		["total"] = 50,
		["anctionName"] = "sing_01_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_1",
		["song_id"] = 54,
		["num"] = 5,
	},
	[41] = {
		["sentences_pool"] = {
			[1] = 401,
			[2] = 402,
			[3] = 403,
			[4] = 404,
		},
		["total"] = 40,
		["anctionName"] = "sing_02_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/daily",
		["song_id"] = 41,
		["num"] = 4,
	},
	[43] = {
		["sentences_pool"] = {
			[1] = 421,
			[2] = 422,
			[3] = 423,
			[4] = 424,
		},
		["total"] = 40,
		["anctionName"] = "sing_04_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_2",
		["song_id"] = 43,
		["num"] = 4,
	},
	[31] = {
		["sentences_pool"] = {
			[1] = 301,
			[2] = 302,
			[3] = 303,
		},
		["total"] = 30,
		["anctionName"] = "sing_02_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/daily",
		["song_id"] = 31,
		["num"] = 3,
	},
	[32] = {
		["sentences_pool"] = {
			[1] = 311,
			[2] = 312,
			[3] = 313,
		},
		["total"] = 30,
		["anctionName"] = "sing_01_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_1",
		["song_id"] = 32,
		["num"] = 3,
	},
	[64] = {
		["sentences_pool"] = {
			[1] = 641,
			[2] = 642,
			[3] = 643,
			[4] = 644,
			[5] = 645,
			[6] = 646,
		},
		["total"] = 60,
		["anctionName"] = "sing_04_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_2",
		["song_id"] = 64,
		["num"] = 6,
	},
	[51] = {
		["sentences_pool"] = {
			[1] = 501,
			[2] = 502,
			[3] = 503,
			[4] = 504,
			[5] = 505,
		},
		["total"] = 50,
		["anctionName"] = "sing_02_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/daily",
		["song_id"] = 51,
		["num"] = 5,
	},
	[53] = {
		["sentences_pool"] = {
			[1] = 521,
			[2] = 522,
			[3] = 523,
			[4] = 524,
			[5] = 525,
		},
		["total"] = 50,
		["anctionName"] = "sing_04_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_2",
		["song_id"] = 53,
		["num"] = 5,
	},
	[63] = {
		["sentences_pool"] = {
			[1] = 621,
			[2] = 622,
			[3] = 623,
			[4] = 624,
			[5] = 625,
			[6] = 626,
		},
		["total"] = 60,
		["anctionName"] = "sing_04_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_2",
		["song_id"] = 63,
		["num"] = 6,
	},
	[42] = {
		["sentences_pool"] = {
			[1] = 411,
			[2] = 412,
			[3] = 413,
			[4] = 414,
		},
		["total"] = 40,
		["anctionName"] = "sing_01_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_1",
		["song_id"] = 42,
		["num"] = 4,
	},
	[44] = {
		["sentences_pool"] = {
			[1] = 441,
			[2] = 442,
			[3] = 443,
			[4] = 444,
		},
		["total"] = 40,
		["anctionName"] = "sing_02_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/daily",
		["song_id"] = 44,
		["num"] = 4,
	},
	[62] = {
		["sentences_pool"] = {
			[1] = 611,
			[2] = 612,
			[3] = 613,
			[4] = 614,
			[5] = 615,
			[6] = 616,
		},
		["total"] = 60,
		["anctionName"] = "sing_01_01",
		["res"] = "res/image/anim/other/actmuise/actmuise",
		["music"] = "res/audio/activity/song_1",
		["song_id"] = 62,
		["num"] = 6,
	},
}

reaction = {
	[1] = {
		["type"] = 1,
		["effecttype"] = 2,
		["chattype"] = 1,
		["anctionName"] = "best",
		["desc"] = "尖叫欢呼",
		["count"] = 5,
		["audioName"] = "res/audio/activity/viewer_1",
		["allCount"] = 8,
		["effect"] = "res/image/effect/ui/music_pre/music_pre_10.csb",
		["chat"] = {
			[1] = "缪斯缪斯缪斯！！",
			[2] = "女神女神女神！",
			[3] = "我的天，这也太好听了",
			[4] = "疯狂打call！",
			[5] = "我要被美哭了！",
			[6] = "啊啊啊啊啊！",
			[7] = "缪斯！我爱你！",
			[8] = "别问我为什么跪着！",
			[9] = "天籁之音！",
			[10] = "啊！我死了！",
			[11] = "如果爱有一种颜色！",
			[12] = "缪斯！最高！",
			[13] = "此生无憾！",
			[14] = "天后巨星！",
			[15] = "眼泪止不住了！",
			[16] = "爱她就喊出来！",
			[17] = "今晚是属于缪斯的！",
			[18] = "这才是音乐！",
			[19] = "希望此刻能永恒！",
			[20] = "你就是我们的梦想！",
			[21] = "我要窒息了！",
			[22] = "好听到疯了！！",
			[23] = "哭了哭了！",
			[24] = "喜极而涕！",
			[25] = "你最美！！！",
			[26] = "心脏炸裂啊！",
			[27] = "完美！",
			[28] = "吹爆这首歌！！",
			[29] = "大满足！",
			[30] = "心都化了！",
			[31] = "核能来了",
			[32] = "没毛病",
			[33] = "讲究",
			[34] = "开口跪",
			[35] = "蜜汁好听",
			[36] = "妙啊",
			[37] = "会上瘾",
			[38] = "死歌开大了",
			[39] = "鬼才",
		},
	},
	[2] = {
		["type"] = 2,
		["effecttype"] = 1,
		["chattype"] = 3,
		["anctionName"] = "middle",
		["desc"] = "褒贬不一",
		["count"] = 3,
		["audioName"] = "res/audio/activity/viewer_2",
		["allCount"] = 4,
		["chat"] = {
			[1] = "差强人意",
			[2] = "我觉得还可以",
			[3] = "Emmmmmm",
			[4] = "有失水准啊",
			[5] = "还行吧，虽然不是最好",
			[6] = "换个词可能好些",
			[7] = "感觉怪怪的",
			[8] = "谁都会有失误啦",
			[9] = "别灰心，依然爱你！",
			[10] = "感觉不咋地",
			[11] = "要求不能太高",
			[12] = "我就听听不说话",
			[13] = "还是用了心思的",
			[14] = "一言难尽",
			[15] = "⊙_⊙",
			[16] = "今天状态不对",
			[17] = "也是蛮拼的",
		},
	},
	[3] = {
		["type"] = 3,
		["effecttype"] = 1,
		["chattype"] = 3,
		["anctionName"] = "worst",
		["desc"] = "尴尬至极",
		["count"] = 4,
		["audioName"] = "res/audio/activity/viewer_3",
		["allCount"] = 4,
		["effect"] = "res/image/effect/ui/music_pre/music_pre_11.csb",
		["chat"] = {
			[1] = "什么玩意？",
			[2] = "Get不到点",
			[3] = "好尴尬啊",
			[4] = "我是谁？我在哪？",
			[5] = "唱的是啥？",
			[6] = "……",
			[7] = "我切错了频道？",
			[8] = "假唱！一定是假唱！",
			[9] = "爱不起来了……",
			[10] = "切歌吧",
			[11] = "重唱吧",
			[12] = "？？？？",
			[13] = "这是什么骚操作？",
			[14] = "=_=",
			[15] = "= =|||",
			[16] = "额……",
			[17] = "以后还是别唱歌了",
			[18] = "求转行！",
			[19] = "尴尬",
			[20] = "……………",
			[21] = "（￣口￣）",
			[22] = "(@_@)",
			[23] = "（︶︿︶）",
			[24] = "莫名好笑",
			[25] = "发生了什么？？",
			[26] = "呃",
			[27] = "现在跑还来得及",
			[28] = "辣耳朵",
			[29] = "天了噜",
			[30] = "我要下车",
			[31] = "团灭",
			[32] = "逼死调音师",
			[33] = "调音师要跪了",
			[34] = "该来的还是要来",
			[35] = "脑壳疼",
			[36] = "苍天饶过谁",
		},
	},
}

conf = {
	["a"] = {
		["str"] = "res/image/ui/13_drawing/muise.png",
		["key"] = "a",
		["tbl"] = {
		},
	},
	["cost_num"] = {
		["tbl"] = {
		},
		["num"] = 30,
		["key"] = "cost_num",
	},
	["thanks_audio"] = {
		["str"] = "res/audio/activity/thanks",
		["key"] = "thanks_audio",
		["tbl"] = {
		},
	},
	["universal_item_cost_num"] = {
		["tbl"] = {
		},
		["num"] = 30,
		["key"] = "universal_item_cost_num",
	},
	["mail_id_pop"] = {
		["str"] = "40042",
		["key"] = "mail_id_pop",
		["tbl"] = {
		},
	},
	["viewer_res"] = {
		["str"] = "res/image/anim/other/viewer/viewer",
		["key"] = "viewer_res",
		["tbl"] = {
		},
	},
	["universal_item_id"] = {
		["tbl"] = {
		},
		["num"] = 110345,
		["key"] = "universal_item_id",
	},
	["mail_id_target"] = {
		["str"] = "40043",
		["key"] = "mail_id_target",
		["tbl"] = {
		},
	},
	["universal_item_effect"] = {
		["key"] = "universal_item_effect",
		["tbl"] = {
			[1] = {
				[1] = 10,
				[2] = 1,
				[3] = 1,
			},
		},
	},
}

target = {
	[1] = {
		["type"] = 1,
		["target_id"] = 1,
		["doc"] = "完成%s的歌曲",
		["award"] = 30,
		["param"] = {
			[1] = {
				[1] = 3,
				[2] = 1,
			},
		},
	},
	[2] = {
		["type"] = 1,
		["target_id"] = 2,
		["doc"] = "完成%s的歌曲",
		["award"] = 40,
		["param"] = {
			[1] = {
				[1] = 4,
				[2] = 1,
			},
		},
	},
	[3] = {
		["type"] = 1,
		["target_id"] = 3,
		["doc"] = "完成%s的歌曲",
		["award"] = 50,
		["param"] = {
			[1] = {
				[1] = 5,
				[2] = 1,
			},
		},
	},
	[4] = {
		["type"] = 1,
		["target_id"] = 4,
		["doc"] = "完成%s的歌曲",
		["award"] = 60,
		["param"] = {
			[1] = {
				[1] = 6,
				[2] = 1,
			},
		},
	},
	[5] = {
		["type"] = 2,
		["target_id"] = 5,
		["doc"] = "完成1首观众%s的歌",
		["award"] = 40,
		["param"] = {
			[1] = {
				[1] = 1,
				[2] = 2,
			},
		},
	},
	[6] = {
		["type"] = 2,
		["target_id"] = 6,
		["doc"] = "完成1首观众%s的歌",
		["award"] = 60,
		["param"] = {
			[1] = {
				[1] = 1,
				[2] = 3,
			},
		},
	},
	[7] = {
		["type"] = 2,
		["target_id"] = 7,
		["doc"] = "完成1首观众%s的歌",
		["award"] = 40,
		["param"] = {
			[1] = {
				[1] = 2,
				[2] = 2,
			},
		},
	},
	[8] = {
		["type"] = 2,
		["target_id"] = 8,
		["doc"] = "完成1首观众%s的歌",
		["award"] = 40,
		["param"] = {
			[1] = {
				[1] = 3,
				[2] = 2,
			},
		},
	},
	[9] = {
		["type"] = 2,
		["target_id"] = 9,
		["doc"] = "完成1首观众%s的歌",
		["award"] = 80,
		["param"] = {
			[1] = {
				[1] = 1,
				[2] = 3,
			},
			[2] = {
				[1] = 2,
				[2] = 1,
			},
		},
	},
	[10] = {
		["type"] = 2,
		["target_id"] = 10,
		["doc"] = "完成1首观众%s的歌",
		["award"] = 120,
		["param"] = {
			[1] = {
				[1] = 1,
				[2] = 2,
			},
			[2] = {
				[1] = 2,
				[2] = 2,
			},
			[3] = {
				[1] = 3,
				[2] = 2,
			},
		},
	},
	[11] = {
		["type"] = 3,
		["target_id"] = 11,
		["doc"] = "完成1首人气%s或以上的歌曲",
		["award"] = 30,
		["param"] = {
			[1] = 25,
		},
	},
	[12] = {
		["type"] = 3,
		["target_id"] = 12,
		["doc"] = "完成1首人气%s或以上的歌曲",
		["award"] = 50,
		["param"] = {
			[1] = 35,
		},
	},
	[13] = {
		["type"] = 3,
		["target_id"] = 13,
		["doc"] = "完成1首人气%s或以上的歌曲",
		["award"] = 60,
		["param"] = {
			[1] = 37,
		},
	},
	[14] = {
		["type"] = 3,
		["target_id"] = 14,
		["doc"] = "完成1首人气%s或以上的歌曲",
		["award"] = 80,
		["param"] = {
			[1] = 45,
		},
	},
	[15] = {
		["type"] = 3,
		["target_id"] = 15,
		["doc"] = "完成1首人气%s或以上的歌曲",
		["award"] = 120,
		["param"] = {
			[1] = 50,
		},
	},
}

award = {
	[1] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1025,
					[2] = 60,
				},
			},
		},
		["stage_id"] = 1,
	},
	[2] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 300,
				},
			},
		},
		["stage_id"] = 2,
	},
	[3] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1036,
					[2] = 60,
				},
			},
		},
		["stage_id"] = 3,
	},
	[4] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 10000,
			},
		},
		["stage_id"] = 4,
	},
	[5] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1037,
					[2] = 60,
				},
			},
		},
		["stage_id"] = 5,
	},
	[6] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 300,
				},
			},
		},
		["stage_id"] = 6,
	},
	[7] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 8009,
					[2] = 10,
				},
			},
		},
		["stage_id"] = 7,
	},
	[8] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 130002,
					[2] = 20,
				},
			},
		},
		["stage_id"] = 8,
	},
	[9] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 20000,
			},
		},
		["stage_id"] = 9,
	},
	[10] = {
		["schedule"] = 50,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1304,
					[2] = 1,
				},
			},
		},
		["stage_id"] = 10,
	},
	[11] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 600,
				},
			},
		},
		["stage_id"] = 11,
	},
	[12] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 20000,
			},
		},
		["stage_id"] = 12,
	},
	[13] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 8009,
					[2] = 10,
				},
			},
		},
		["stage_id"] = 13,
	},
	[14] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1048,
					[2] = 2,
				},
			},
		},
		["stage_id"] = 14,
	},
	[15] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 600,
				},
			},
		},
		["stage_id"] = 15,
	},
	[16] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1038,
					[2] = 50,
				},
			},
		},
		["stage_id"] = 16,
	},
	[17] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 20000,
			},
		},
		["stage_id"] = 17,
	},
	[18] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1039,
					[2] = 50,
				},
			},
		},
		["stage_id"] = 18,
	},
	[19] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 600,
				},
			},
		},
		["stage_id"] = 19,
	},
	[20] = {
		["schedule"] = 80,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1040,
					[2] = 50,
				},
			},
		},
		["stage_id"] = 20,
	},
	[21] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 8009,
					[2] = 10,
				},
			},
		},
		["stage_id"] = 21,
	},
	[22] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 130002,
					[2] = 20,
				},
			},
		},
		["stage_id"] = 22,
	},
	[23] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 900,
				},
			},
		},
		["stage_id"] = 23,
	},
	[24] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 50000,
			},
		},
		["stage_id"] = 24,
	},
	[25] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1304,
					[2] = 1,
				},
			},
		},
		["stage_id"] = 25,
	},
	[26] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 900,
				},
			},
		},
		["stage_id"] = 26,
	},
	[27] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 50000,
			},
		},
		["stage_id"] = 27,
	},
	[28] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 8009,
					[2] = 10,
				},
			},
		},
		["stage_id"] = 28,
	},
	[29] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1048,
					[2] = 2,
				},
			},
		},
		["stage_id"] = 29,
	},
	[30] = {
		["schedule"] = 100,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1041,
					[2] = 40,
				},
			},
		},
		["stage_id"] = 30,
	},
	[31] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 900,
				},
			},
		},
		["stage_id"] = 31,
	},
	[32] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1042,
					[2] = 40,
				},
			},
		},
		["stage_id"] = 32,
	},
	[33] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 50000,
			},
		},
		["stage_id"] = 33,
	},
	[34] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1043,
					[2] = 40,
				},
			},
		},
		["stage_id"] = 34,
	},
	[35] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 900,
				},
			},
		},
		["stage_id"] = 35,
	},
	[36] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 8009,
					[2] = 10,
				},
			},
		},
		["stage_id"] = 36,
	},
	[37] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 130002,
					[2] = 20,
				},
			},
		},
		["stage_id"] = 37,
	},
	[38] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 50000,
			},
		},
		["stage_id"] = 38,
	},
	[39] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 900,
				},
			},
		},
		["stage_id"] = 39,
	},
	[40] = {
		["schedule"] = 140,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 50000,
			},
		},
		["stage_id"] = 40,
	},
	[41] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 130002,
					[2] = 20,
				},
			},
		},
		["stage_id"] = 41,
	},
	[42] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1304,
					[2] = 1,
				},
			},
		},
		["stage_id"] = 42,
	},
	[43] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110350,
					[2] = 1,
				},
			},
		},
		["stage_id"] = 43,
	},
	[44] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 1200,
				},
			},
		},
		["stage_id"] = 44,
	},
	[45] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 130003,
					[2] = 10,
				},
			},
		},
		["stage_id"] = 45,
	},
	[46] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 1200,
				},
			},
		},
		["stage_id"] = 46,
	},
	[47] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 8009,
					[2] = 10,
				},
			},
		},
		["stage_id"] = 47,
	},
	[48] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1304,
					[2] = 1,
				},
			},
		},
		["stage_id"] = 48,
	},
	[49] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 2400,
				},
			},
		},
		["stage_id"] = 49,
	},
	[50] = {
		["schedule"] = 180,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 130002,
					[2] = 20,
				},
			},
		},
		["stage_id"] = 50,
	},
	[51] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 130003,
					[2] = 10,
				},
			},
		},
		["stage_id"] = 51,
	},
	[52] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 2400,
				},
			},
		},
		["stage_id"] = 52,
	},
	[53] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1304,
					[2] = 2,
				},
			},
		},
		["stage_id"] = 53,
	},
	[54] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 130003,
					[2] = 10,
				},
			},
		},
		["stage_id"] = 54,
	},
	[55] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 2400,
				},
			},
		},
		["stage_id"] = 55,
	},
	[56] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110350,
					[2] = 1,
				},
			},
		},
		["stage_id"] = 56,
	},
	[57] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 2400,
				},
			},
		},
		["stage_id"] = 57,
	},
	[58] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1304,
					[2] = 2,
				},
			},
		},
		["stage_id"] = 58,
	},
	[59] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 59,
	},
	[60] = {
		["schedule"] = 220,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1304,
					[2] = 2,
				},
			},
		},
		["stage_id"] = 60,
	},
	[61] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 61,
	},
	[62] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 62,
	},
	[63] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 1304,
					[2] = 2,
				},
			},
		},
		["stage_id"] = 63,
	},
	[64] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 64,
	},
	[65] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 65,
	},
	[66] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 66,
	},
	[67] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 67,
	},
	[68] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 68,
	},
	[69] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 69,
	},
	[70] = {
		["schedule"] = 260,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 70,
	},
	[71] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 71,
	},
	[72] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 72,
	},
	[73] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 73,
	},
	[74] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 74,
	},
	[75] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 75,
	},
	[76] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 76,
	},
	[77] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 77,
	},
	[78] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 78,
	},
	[79] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["items"] = {
				[1] = {
					[1] = 110346,
					[2] = 3600,
				},
			},
		},
		["stage_id"] = 79,
	},
	[80] = {
		["schedule"] = 300,
		["schedule_drop"] = {
			["res"] = {
				["gold"] = 100000,
			},
		},
		["stage_id"] = 80,
	},
}

result = {
	[1] = {
		["name"] = "缪斯",
		["bgEffect"] = "res/image/effect/ui/music_pre/music_pre_15_xh_sss.csb",
		["id"] = 1,
		["level"] = "res/image/effect/ui/music_pre/music_pre_20_sss_ani.csb",
		["result"] = 1,
		["chat"] = "哇奥~制作人君简直是天才，你一定可以让缪斯成为最闪耀的明星！",
	},
	[2] = {
		["name"] = "缪斯",
		["bgEffect"] = "res/image/effect/ui/music_pre/music_pre_14_xh_ss.csb",
		["id"] = 2,
		["level"] = "res/image/effect/ui/music_pre/music_pre_19_ss_ani.csb",
		["result"] = 0.85,
		["chat"] = "嘛~不愧是我挑选的制作人君，实力果然非同凡响~",
	},
	[3] = {
		["name"] = "缪斯",
		["bgEffect"] = "res/image/effect/ui/music_pre/music_pre_12_xh_a_s.csb",
		["id"] = 3,
		["level"] = "res/image/effect/ui/music_pre/music_pre_18_s_ani.csb",
		["result"] = 0.65,
		["chat"] = "EMMMMMM，勉强达到及格分吧，下次要加把劲哦~制作人君~",
	},
	[4] = {
		["name"] = "缪斯",
		["bgEffect"] = "res/image/effect/ui/music_pre/music_pre_12_xh_a_s.csb",
		["id"] = 4,
		["level"] = "res/image/effect/ui/music_pre/music_pre_17_a_ani.csb",
		["result"] = 0.5,
		["chat"] = "呜呜，难道制作人君是故意的？欺负人的话就再也不理你了，哼！",
	},
}

stage = {
	[1] = {
		["open_day"] = {
			[1] = 1,
			[2] = 2,
			[3] = 3,
		},
		["target"] = {
			[1] = {
				[1] = 1,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 2,
			},
			[3] = {
				[1] = 3,
				[2] = 1,
			},
		},
		["song_pool"] = {
			[1] = 31,
			[2] = 42,
			[3] = 53,
			[4] = 61,
			[5] = 32,
			[6] = 43,
		},
		["target_pool"] = {
			[1] = 1,
			[2] = 2,
			[3] = 3,
			[4] = 4,
		},
		["stage_id"] = 1,
	},
	[2] = {
		["open_day"] = {
			[1] = 4,
			[2] = 5,
			[3] = 6,
		},
		["target"] = {
			[1] = {
				[1] = 6,
				[2] = 8,
			},
			[2] = {
				[1] = 9,
				[2] = 7,
			},
			[3] = {
				[1] = 5,
				[2] = 10,
			},
		},
		["song_pool"] = {
			[1] = 31,
			[2] = 42,
			[3] = 53,
			[4] = 61,
			[5] = 32,
			[6] = 43,
			[7] = 51,
			[8] = 62,
			[9] = 54,
		},
		["target_pool"] = {
			[1] = 5,
			[2] = 6,
			[3] = 7,
			[4] = 8,
			[5] = 9,
			[6] = 10,
		},
		["stage_id"] = 2,
	},
	[3] = {
		["open_day"] = {
			[1] = 7,
			[2] = 8,
			[3] = 9,
		},
		["target"] = {
			[1] = {
				[1] = 13,
				[2] = 14,
			},
			[2] = {
				[1] = 15,
				[2] = 12,
			},
			[3] = {
				[1] = 11,
				[2] = 15,
			},
		},
		["song_pool"] = {
			[1] = 31,
			[2] = 42,
			[3] = 53,
			[4] = 61,
			[5] = 32,
			[6] = 43,
			[7] = 51,
			[8] = 62,
			[9] = 54,
			[10] = 33,
			[11] = 41,
			[12] = 64,
		},
		["target_pool"] = {
			[1] = 11,
			[2] = 12,
			[3] = 13,
			[4] = 14,
			[5] = 15,
		},
		["stage_id"] = 3,
	},
	[4] = {
		["open_day"] = {
			[1] = 10,
			[2] = 11,
			[3] = 12,
			[4] = 13,
			[5] = 14,
		},
		["target"] = {
			[1] = {
				[1] = 2,
				[2] = 7,
				[3] = 12,
			},
			[2] = {
				[1] = 6,
				[2] = 1,
				[3] = 13,
			},
			[3] = {
				[1] = 11,
				[2] = 10,
				[3] = 4,
			},
			[4] = {
				[1] = 3,
				[2] = 9,
				[3] = 5,
			},
			[5] = {
				[1] = 14,
				[2] = 8,
				[3] = 15,
			},
		},
		["song_pool"] = {
			[1] = 31,
			[2] = 42,
			[3] = 53,
			[4] = 61,
			[5] = 32,
			[6] = 43,
			[7] = 51,
			[8] = 62,
			[9] = 54,
			[10] = 33,
			[11] = 41,
			[12] = 64,
			[13] = 52,
			[14] = 63,
			[15] = 44,
		},
		["target_pool"] = {
			[1] = 0,
			[2] = "同上",
			[3] = "以上目标都有可能出现",
		},
		["stage_id"] = 4,
	},
}



