module('XML_playerskin', package.seeall)

hero = {
	["4018"] = {
		["story"] = "<font>    和平总能给国家带来繁荣与生机，奥顿帝国也不例外。<br/>    炎神菲尼克斯被击败，炎神竞技场也沦为一片废墟，笼罩在帝国头上的乌云已经消散，整个帝国都焕然一新，营造出一副欣欣向荣的繁荣景象。<br/>    而身为竞技场守门人的拉娜克希娅，自然也迎来了新的委任，成为了奥顿帝国的外交特使，乘坐空艇访问各国政要，为奥顿帝国融入奥罗拉世界建立基础。<br/>    褪去骑士装扮，拉娜克希娅自皇宫之乱后再次穿上礼服的长裙，一改曾经的军人形象，变得媚态万千。<br/>    看着镜中少女明艳的朱唇，翻飞的裙摆，拉娜感到一阵恍惚，她曾经真的以为，自己要在自责中行尸走肉般度过余生，但最终却在奋力一搏中让帝国重获新生，而这一切改变，都始于那个人。<br/>    联想到此处，镜中的拉娜不禁勾起唇角，脑中同时决定了，她的第一个目的地。<br/>    在第二天的会议上，拉娜克希娅顶着埃德蒙戏谑的目光，严肃地陈述了首先拜访弥赛亚的必要性，随后得到了少年皇帝的肯首。<br/>    而听闻奥顿帝国外交官来访的消息，冒险者协会如临大敌，协会公馆的全员一早便在门口列队迎接，而队伍中的某位团长大人却忍不住打起了哈欠，显得格外突出，拉娜克希娅一眼便锁定了目标。<br/>    少女身肢修长，眼神锐利，在红裙的映衬下，笑脸更是明媚异常，唯一违和之处，便是在其妩媚的姿势遮掩下，依然显得夺目的巨大镰刀。<br/>    打着哈欠的你不禁瞪大眼睛，一脸难以置信地看着一副礼服装扮的拉娜克希娅，对方却笑得灿烂大方。<br/>    “团长阁下，这次轮到我成为特使了，相信向导一职，你一定不会拒绝吧~”<br/>    没等你回答，拉娜克希娅便一把抱住你的手臂，在众人羡艳的目光中与你一同乘上了特使专属的马车，开始了不知终点为何处的向导之旅。",
		["open_type"] = {
			["item"] = 9220,
		},
		["id"] = "4018",
		["cv_name"] = "井上麻里奈",
		["voice_id"] = 49,
		["combo3_pos"] = {
			[1] = 193,
			[2] = -6,
		},
		["name"] = "蔷薇特使",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 132,
			[2] = -135,
			[3] = 90,
		},
		["heroid"] = 10050,
	},
	["4006"] = {
		["story"] = "<font>    帝隆在魔法森林的遭遇，导致其丧失了体内所有的魔力，却在神秘老者点拨下，却俨然发现了一个崭新的世界。<br/>    “外法万千，天道归一。所谓魔法，不过是通往天道的殊途之一罢了。”明明体内的魔力空空如也，身体却前所未有的轻盈，将身心放空，宁静地感悟一番后，帝隆恍然大悟。魔力本就广泛地存在于天地之间，将视野局限于自身，不过是常人认知的误区。理解到这一点，帝隆一改曾经的修炼方式，变动为静，日复一日地在山巅静坐，凝神冥思。随着时间的流逝，渐渐地，山川、河流、树木、云翳……一切的一切都在帝隆的感悟间变得模糊起来，万物仿佛都失去了形态，变成了无法捕捉的魔力流动。<br/>    不知过去多久，帝隆突然睁开了双目，向着空无一物的眼前轻轻一抓，翻手展开，一簇火苗在他掌中慢慢升腾，身后的老者见此，露出了欣慰的笑容。<br/>    再没有指导的必要，老者留下了一套衣服作为别礼，便再无出现过，帝隆也决定再次踏上修行之路。<br/>    换上了全新的装束，帝隆来到了山巅，淡然地看着山下的崎岖道路，随即纵身一跃，脚下虚空中数个轻点，身影消失在群山云雾之中。",
		["open_type"] = {
			["item"] = 9208,
		},
		["id"] = "4006",
		["cv_name"] = "浅沼晋太郎",
		["voice_id"] = 12,
		["combo3_pos"] = {
			[1] = 272,
			[2] = -136,
		},
		["name"] = "炎拳宗师(限定)",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 210,
			[2] = -216,
			[3] = 80,
		},
		["hide"] = 1,
		["heroid"] = 10015,
	},
	["4032"] = {
		["story"] = "<font>    亚巴顿是侍奉冥界之主的死亡骑士，在漫长的时间中，他如同雕像一般地守护在冥界之门前，直到一双纤手将大门推开。<br/>    来者名为贝瑟芬妮，她希望借助冥界之力拯救奥罗拉，在其强大的力量下亚巴顿黯然战败，躯体被毁灭，连灵魂也险些消亡。<br/>    亚巴顿的意识在虚空中飘荡了不知多久，当他再次睁开眼睛，已经处于一个崭新的躯体内。身上的优雅的着装让亚巴顿一瞬间有些茫然，但当他看到已经和冥界之门融为一体的贝瑟芬妮后，便理解了一切，于是单膝跪下，向新王宣告自己的忠诚。<br/>    亚巴顿没有忘记刻在灵魂的誓言，他是侍奉冥界之主的骑士，在冥界之门和贝瑟芬妮融为一体的现在，他便是死之女王最忠诚的仆人。<br/>    于是，以死亡执事的崭新姿态，亚巴顿侍立在女王的身侧，优雅却冷酷地执行着女王的旨意，清扫着挡在女王眼前的一切阴霾。<br/></font>",
		["open_type"] = {
			["item"] = 9204,
		},
		["id"] = "4032",
		["cv_name"] = "小西克幸",
		["voice_id"] = 25,
		["combo3_pos"] = {
			[1] = 149,
			[2] = -199,
		},
		["name"] = "死亡执事",
		["hero_type"] = 2,
		["combo2_pos"] = {
			[1] = 81,
			[2] = -349,
		},
		["heroid"] = 10031,
	},
	["4004"] = {
		["story"] = "<font>    北境的奥罗拉杯球赛开赛在即，在某异界歌姬的建议下，桑妮换上了一身充满运动气息的热辣装扮，还特意将最拿手的大火球控制成了足球的样子。不仅如此，为了彰显自己魔法师的身份，桑妮依然戴上了那顶硕大的帽子，还加上御寒而带上的看起来比较厚实的披风和一堆看球用的小道具……emmm，真是非常混搭而奇异的装扮……<br/>    北地的极寒掩盖不住烈焰般的热情！作为本届奥罗拉杯的女主角(自称)，运动型魔法少女桑妮，闪耀登场！<br/></font>",
		["open_type"] = {
			["item"] = 9206,
		},
		["id"] = "4004",
		["cv_name"] = "悠木碧",
		["voice_id"] = 4,
		["combo3_pos"] = {
			[1] = 158,
			[2] = 123,
			[3] = 75,
		},
		["name"] = "球系大魔导",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 106,
			[2] = -11,
			[3] = 70,
		},
		["heroid"] = 10019,
	},
	["4013"] = {
		["story"] = "<font>    传说中的三贤者，真正窥探到魔法奥秘之人，在圣夜之际短暂地回归奥罗拉，却突然穿上圣诞礼服，与某天使竞争成为圣诞使者。<br/>    随着音乐节拍翩翩起舞，大气中的一切元素便化作了她手脚的延伸，一份份礼物如同获得生命一般，自动飘入了各家各户，根本不是只会吓人一跳的某天使所能匹敌。",
		["open_type"] = {
			["item"] = 9215,
		},
		["id"] = "4013",
		["cv_name"] = "雨宫天",
		["voice_id"] = 56,
		["combo3_pos"] = {
			[1] = 282,
			[2] = 6,
			[3] = 100,
			[4] = 28,
		},
		["name"] = "圣夜舞步",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 210,
			[2] = -120,
			[3] = 80,
			[4] = 28,
		},
		["heroid"] = 10057,
	},
	["4016"] = {
		["story"] = "<font>    圣王国英普瑞恩，是一个政教一体的巨大王国，其领袖的圣王既是教宗，也是国王。<br/>    一般人仅能够知道这二重身份，只有真正侍奉于左右的近臣才能明白，只有那个不为人提起第三个身份，才是圣王于英普瑞恩的真正价值。<br/>    笠晨，整个圣王宫中弥漫着寂静，圣王伊莎贝拉浴池中挽水轻轻搽拭身体，喷泉的入水声清脆悦耳，却被一阵全副武装的脚步声所打乱。<br/>    “艾利欧特么？在余沐浴之际觐见，若没有一个合适的理由，就莫怪余治卿之罪了。”<br/>    脚步声在浴池之外停下，随后便是膝护甲触地的声音，伊莎贝拉则接过侍女递来的洗礼用枝条，仔细地将圣露拍洒在身体各处。<br/>    “陛下，贵族和教廷的首脑们齐聚在王宫门前，请求觐见。”<br/>    “今日是何等重要之日，不需要余来强调吧。”<br/>    “臣明白，这就请他们回去……”<br/>    完成了圣露的洗礼，伊莎贝拉在侍女的帮助下换上了纯白的圣袍，那并非平常的简易圣袍，而是只在最盛大祭祀上穿戴最高规格圣袍。<br/>    “不用了，将王宫大门打开，若真有胆量拦截余之圣驾，就让他们在万千信徒们面前拦吧。”<br/>    圣王宫的沉重门扉缓缓敞开，手持圣杖的伊莎贝拉在一众圣骑士的拥护之下从圣王宫内走出，每踏出一步，缠绕她身周的圣光便越显得明亮。<br/>    门外被信徒们围了个水泄不通，随着圣王的驾临，信徒们如潮水一般拜倒，即便是平常最桀骜不驯的权臣，在理解到状况之后，也不敢与圣驾对视哪怕一秒，只能规规矩矩地拜倒一旁，等待着那庄严的宣告。<br/>    “余亲爱的子民们，愿圣光与汝等同在。”<br/>    随着声音的开启，耀眼的圣光汇聚于伊莎贝拉的身后，形成了翅膀的形状，下一刻，仿佛被某种神圣的存在附身一般，圣王的声音变得庄严而不带一丝感情。<br/>    “圣光的子民们，此刻，聆听圣谕吧，余宣告……”<br/>    广场上万千的教徒就这样保持着匍匐的姿势听完了圣谕的最后一个字，直到圣驾重新回到王宫后，紧闭了大门好一会后，才有陆续信徒散去。<br/>    人群之中，原本还打算在今天向圣王发难的大臣们个个汗流浃背，他们终于明白了一个事实，圣王的价值不在于她能够掌握贵族或者是圣教，只要她能够以神殿的名义宣告圣谕，任何企图反抗她的人都宛如风中残烛，随时随地都会被万千教徒的怒火所淹没。<br/>    想到此处，大臣们一个个无一不感到心有余悸，庆幸自己终究没有踏出那一步，同时暗地里起誓，余生定要全力为圣王陛下效忠，不再会有任何非分之想。",
		["open_type"] = {
			["item"] = 9218,
		},
		["id"] = "4016",
		["cv_name"] = "喜多村英梨",
		["voice_id"] = 18,
		["combo3_pos"] = {
			[1] = -88,
			[2] = 88,
		},
		["name"] = "圣谕宣告",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = -126,
			[2] = -38,
			[3] = 90,
		},
		["heroid"] = 10021,
	},
	["4014"] = {
		["story"] = "<font>    冥界女王贝瑟芬妮以驱逐亡灵为毕生的使命，而归尘之地的混乱，似乎注定她的使命难以一跃而就。<br/>     或许，建立暂时的秩序是必要的，她不禁这样想到。<br/>    于是，贝瑟芬妮以死之权能向归尘之地的强大亡灵发出邀请：盛大的舞会将在她的城堡举办，亡灵即是舞者，应邀的亡灵都会一视同仁被视为女王的臣下。<br/>    那一天，城堡被魔法的光芒照亮，无数亡灵匆匆赶往这唯一的光明之处。<br/>    音乐声中，角落的巨大亡灵忽然站起身子走向舞池。<br/>    舞动的亡灵们不约而同停下，将目光投向大厅中心的两个人……或者说一个人。<br/>    阿蒙穿着黑色的礼服，怀中是紫色礼装的娇小少女。<br/>    少女银白色的双马尾在空中摆动，手中的茶杯还没来得及放下，却毫不介意亡灵的自作主张，温柔地抚摸着它狰狞的脸颊，说道：“阿蒙……也想跳舞吗？”",
		["open_type"] = {
			["item"] = 9216,
		},
		["id"] = "4014",
		["cv_name"] = "悠木碧",
		["voice_id"] = 6,
		["combo3_pos"] = {
			[1] = 47,
			[2] = 83,
		},
		["name"] = "灵魂华尔兹",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 7,
			[2] = -58,
			[3] = 80,
		},
		["heroid"] = 10014,
	},
	["4017"] = {
		["story"] = "<font>    任何事物一旦被得到，其魅力便骤减。<br/>    拥有了前往天道宫任何角落的钥匙，魔女维多利亚便对其日渐失去兴趣。<br/>    她总是百无聊赖地俯视着奥罗拉，直到重新接轨的奥顿帝国吸引了她的注意。<br/>    穿越于镜之国度和现实世界之间的魔女，轻而易举进入了护卫森严的奥顿王宫，其主人埃德蒙二世以残暴的统治闻名于世，此刻却正沉睡在堆积如山的文件之中。<br/>    魔女慵懒地坐在窗户的边缘，晃动着那双令人痴迷的长腿，有些好奇地盯着少年国王天真的睡颜。她想知道这位长相柔和的残暴君主，会有什么有趣的渴望呢？<br/>    维多利亚毫不犹豫地取出魔镜，镜中立刻映出埃德蒙的身影，但紧接着，皇帝褪去了国王的装扮，却穿上了公主的长裙，再眨眼间，凌厉的短发也疯长起来，变得柔顺且温软。<br/>    少年皇帝变成了少女公主，连一向优雅的维多利亚都险些失声赞叹，警惕的埃德蒙立刻睁开双眼，魔女却早已隐入镜之国度。<br/>    然而，变化依然在这惊鸿一瞥间发生，魔镜读到了埃德蒙所渴望之物，并在镜之国度中将其化作了现实。<br/>    当维多利亚回归时，便发现国度中多了一座巨大的岛屿，其上伫立着与现实无异的奥顿帝国。<br/>    维多利亚在这个镜像的奥顿帝国中漫步，街道上的人民热情洋溢地欢迎着她这个异国的旅人，告知她今天是公主的生日，举国都在进行着盛大的庆典。<br/>    而在奥顿皇宫之中，公主埃德里安娜被父母和哥哥们肆意宠爱着，与朋友希娜和拉娜克希娅一同快乐嬉戏，最后在所有人的包围之下，收到了专属于她的生日礼物——帝国守护神菲尼克斯的幼体。<br/>    那位穿着红白长裙的优雅公主，正是埃德蒙映在魔镜中的姿态，而这整个镜像的奥顿帝国，便如同围绕着这位公主构建的梦幻王国一般，充斥着无数的美好，就连现实中侵蚀其灵魂的炎神菲尼克斯，也变成了帝国守护神。<br/>    这就是那个暴君内心最深处的渴望吗？维多利亚不禁嫣然一笑，打消了将这个镜像帝国抹去的想法，任由这个小小的愿望在镜之国度继续发酵着，并期待着有朝一日能为她带来新的乐趣。<br/>    就在维多利亚再度从镜之国度离去之时，被一众亲人好友包围的埃德里安娜突然回头，看着维多利亚消失的方向，心中若有所思。",
		["open_type"] = {
			["item"] = 9219,
		},
		["id"] = "4017",
		["cv_name"] = "钉宫理惠",
		["voice_id"] = 47,
		["combo3_pos"] = {
			[1] = 153,
			[2] = 110,
			[3] = 90,
		},
		["name"] = "帝国公主",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 98,
			[2] = -50,
			[3] = 80,
		},
		["heroid"] = 10048,
	},
	["4002"] = {
		["story"] = "<font>    12岁生日这年，父亲送给了薇薇安一件礼服，那是她母亲生前最喜欢的衣服之一。不过，长期作为骑士被训练的薇薇安，还不习惯穿上这么有女人味的衣服，更不习惯高跟鞋的感觉。<br/>    “很适合你哦！真不愧是我自满的女儿”<br/>    父亲看到这样的女儿，感到骄傲的同时也不胜感慨。<br/>    “你！你这是在笑话我么！”<br/>    处于叛逆期的女儿，不理解父亲的心意。她顺手拿起佩剑，挥向了看着自己的父亲。<br/>         “太天真了！”父亲轻松夺下了薇薇安挥舞的短剑“你现在想碰到我还早了一百年呢！”父亲得意洋洋地说，一边玩弄着手上的金色短剑。<br/>    “去死吧你这个糟老头！”薇薇安配剑被夺，但是势头不减。挥舞着小拳头打到了老爷子的脸上。<br/>    老领主面带笑容地乘势抱住了自己的女儿，而涨红了小脸的薇薇安拼命想要挣开父亲的怀抱。<br/>    这是发生在英普瑞恩大领主家的温馨日常。这是深藏在圣剑骑士心中最珍贵的回忆。<br/></font>",
		["open_type"] = {
			["item"] = 9203,
		},
		["id"] = "4002",
		["cv_name"] = "川澄绫子",
		["voice_id"] = 38,
		["combo3_pos"] = {
			[1] = 235,
			[2] = -141,
		},
		["name"] = "盛装华服",
		["hero_type"] = 2,
		["combo2_pos"] = {
			[1] = 168,
			[2] = -223,
			[3] = 80,
		},
		["heroid"] = 10007,
	},
	["4009"] = {
		["story"] = "<font><font color='#orange#'>*购买本皮肤会额外附赠专属头像框。</font><br/><br/>    月明夜，亭台阁，贵人们把酒言欢间，忽而喧嚣止息，花魁在众侍女的拥护下登场。<br/>    千叶花同色，独艳一枝红，随着花魁的入座，其余的美艳都一瞬间失去了颜色，在她不经意的一笑之下，即便是元寿将尽的老者，也能再度焕发出勃勃生机。<br/>    花魁并非一般的艺女，她们不仅是德艺无双的大师，更是出身尊贵的千金之躯，无数男性为了一睹风彩而豪掷千金，但最终得以一亲芳泽的却是寥寥无几。<br/>    然而，今夜的某位贵人却是志在必得，他想要的从来没有得不到的，哪怕是用最粗暴的方式。<br/>    曲终宴散，夜深人静，褪下繁重华衣的花魁倚坐在窗前，举杯独赏着明月，寝居的大门却不解风情地被踢开，迎进来一队身穿黑衣的刀手。<br/>    “莉可丽丝阁下，吾等主公相邀，请随吾等前去。”<br/>    莉可丽丝轻轻地放下酒杯，迷离的醉眼飘向门前的刀手，舌尖在朱唇上舐过，就像在看着什么诱人的佳肴，手中不知何时握住了匕首。<br/>    血月夜，亭台阁，莉可丽丝赤裸着双足在血泊中走过，端起余温还未散尽的酒杯，将酒一饮而尽，露出了满足的笑容。",
		["open_type"] = {
			["item"] = 9211,
		},
		["id"] = "4009",
		["cv_name"] = "雨宫天",
		["voice_id"] = 7,
		["combo3_pos"] = {
			[1] = 144,
			[2] = -251,
		},
		["name"] = "绝代花魁",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 92,
			[2] = -295,
			[3] = 80,
		},
		["heroid"] = 10001,
	},
	["4038"] = {
		["story"] = "<font>    那时的疾风还很年轻，身为家族中的少主，他最喜欢用剑来贯彻自己的侠义之道。作为某剑道流派的传人，天赋异禀的他，二十出头时就在各个流派间初绽锋芒，凭着高超的剑术在故乡的小镇中行侠仗义，走到哪都会受到镇民的赞誉。<br/>    然而，随着他的名气日渐扩散，不喜欢他的人也渐渐多了起来，这之中不乏有一些和疾风存在过节的亡命之徒。<br/>    在某天晚上，疾风的仇家集结了大量的人手将归家途中的他团团围住，在察觉到自己无法全身而退后，疾风做好了舍命大闹一场的准备。在这危急关头，人群外围突然响起喧闹声。曾受到过疾风帮助的人们，手持各种奇形怪状的“武器”，奋力地协助他成功杀出重围。劫后余生的疾风才意识到，自己的身边早已在不知不觉中，多了许多志同道合的跟随者。他们聚集在疾风身边，逐渐形成一股势力，这股势力被当地人称为“疾风组”，是一个贯彻侠义精神的极道帮派。<br/>    疾风，一个神秘而又强大的流浪武士。现在展现的，是这位武士青年时的姿态。代表着侠义与武士道，自信而坚定的“疾风组”组长，以年轻的极道少主的身份，重新加入到新时代的冒险中！<br/></font>",
		["open_type"] = {
			["item"] = 9201,
		},
		["id"] = "4038",
		["cv_name"] = "杉田智和",
		["voice_id"] = 32,
		["combo3_pos"] = {
			[1] = 293,
			[2] = -172,
		},
		["name"] = "极道少主",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 231,
			[2] = -341,
		},
		["heroid"] = 10036,
	},
	["4015"] = {
		["story"] = "<font>    夏洛特曾说过自己来自东方，一个充满着人文气息的神秘国度。<br/>    在那里，有一个叫做新年的节日。每到那个节日，人们穿着红艳艳的衣裳出门道贺、举办庆典，整个城市都会变成红色的海洋，充满着喜庆与热闹。<br/>    今年，被巡界庆典的节日氛围所感染，夏洛特记起了家乡的春节已经快到了。<br/>    即使身处异乡，故土的节日也不能被遗忘。于是乎，夏洛特换上了专属于春节的传统服装，舞起东方的神龙，在街头巷尾传唱着这个异国的节日。<br/>    也许是被夏洛特的乡愁所感染，极具包容性的弥赛亚人民也纷纷效仿，自发地翻找出各种红艳的装饰品，为这个异国的节日增添色彩。<br/>    不知不觉间，神龙所过之处变成了红色的海洋，整个弥赛亚成为了沉醉于春节气氛中的欢乐城市。",
		["open_type"] = {
			["item"] = 9217,
		},
		["id"] = "4015",
		["cv_name"] = "上坂堇",
		["voice_id"] = 51,
		["combo3_pos"] = {
			[1] = -17,
			[2] = 44,
		},
		["name"] = "神龙降福",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = -20,
			[2] = -66,
			[3] = 75,
		},
		["heroid"] = 10052,
	},
	["4008"] = {
		["story"] = "<font>    人类从未战胜过龙，所谓屠龙者不过是一个骗局。<br/>    邪龙本就命不久矣，它和初代齐格飞做了个交易，将龙魂注入其体内后，以龙血染尽了齐格飞的全身，成就了其屠龙者的威名。<br/>    “吾既是力量，也是诅咒，汝等终将化作为龙。”<br/>    享受着屠龙者的荣光，初代齐格飞以为一切不过是妄言，但随着时间演化，他发现自己寿命在不断延长，生育能力在不断下降，狂怒之时甚至会发生局部龙化。<br/>    诅咒确确实实地存在，齐格飞家族的结局已然注定，全身龙化失去理智，成为破坏与杀戮的邪龙化身。<br/>    那之后，齐格飞家族繁衍了无数代，面对这个宿命的诅咒，每一代齐格飞都选择了同样的做法，在理智尚存之际奔赴战场，以人类的姿态战死沙场。<br/>    无数年后，当代齐格飞也终于面临那个决断的时刻。<br/>    “来吧，是时候为这段宿命，画下一个句号了。”<br/>    缠绵了无数代人的诅咒，齐格飞打算用双手为其落下帷幕。没有观众，也没有血与火，一场精神世界的漫长战斗就此展开，当齐格飞再度睁开双眼，龙鳞之铠已然覆盖了半个身躯，双瞳也化作了龙的形状。<br/>    人类能否战胜龙？这个姿态的齐格飞已经无法回答，只有当他面对最重要之人的瞬间，答案才会揭晓吧。",
		["open_type"] = {
			["item"] = 9210,
		},
		["id"] = "4008",
		["cv_name"] = "浪川大辅",
		["voice_id"] = 22,
		["combo3_pos"] = {
			[1] = 329,
			[2] = -86,
		},
		["name"] = "邪龙降临",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 277,
			[2] = -259,
		},
		["heroid"] = 10027,
	},
	["4011"] = {
		["story"] = "<font>    音乐！夏日！祭典！音乐祭席卷弥赛亚，人们高唱着欢歌，共同享受这个快乐夏日。<br/>    少女身着清凉衣装，撑着纸伞，在烟花月下与你共步，还时不时向你投来视线。<br/>    不经意的四目相对间，她的脸颊泛起绯红，短促的呼吸起落后，似乎鼓起了那小小的勇气，向你开口道。<br/>    “那个……团长……你确定没有拿错衣服吗？”<br/>    “怎么会呢？相当合适啊，简直完美。“<br/>    “但是……我可是男孩子啊……”<br/>    “嗯，的确有些问题呢，我应该反省。”<br/>    “呼……松了口气，那我换回正常的……”<br/>    “居然这么晚才发现你的如此适合女装，简直是耻辱啊！（捶地）”<br/>    “我指的不是这个啊……（泪目）”",
		["open_type"] = {
			["item"] = 9213,
		},
		["id"] = "4011",
		["cv_name"] = "高桥李依",
		["voice_id"] = 8,
		["combo3_pos"] = {
			[1] = 279,
			[2] = -18,
			[3] = 90,
		},
		["name"] = "夏祭心跳",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 211,
			[2] = -103,
			[3] = 70,
		},
		["heroid"] = 10010,
	},
	["4001"] = {
		["story"] = "<font>    传说在过去的战斗之中，为了守护奥罗拉的生命，一名高洁的守护天使牺牲了自己。虽然如今的她已经重生，但是她在倾尽全力之后，失去了记忆以及身为守护者的力量，洁白的羽翼上也少了几分光芒。<br/>    路西菲尔，一个被人遗忘的名字。现在展现的，是这位高洁天使真正的姿态。代表着守护和神罚，严厉而高傲的天使，以白翼的世界守护者的身份，重新加入到新时代的冒险中。<br/></font>",
		["open_type"] = {
			["item"] = 9202,
		},
		["id"] = "4001",
		["cv_name"] = "能登麻美子",
		["voice_id"] = 3,
		["combo3_pos"] = {
			[1] = 287,
			[2] = 32,
		},
		["name"] = "世界守护者",
		["hero_type"] = 2,
		["combo2_pos"] = {
			[1] = 228,
			[2] = -127,
		},
		["heroid"] = 10006,
	},
	["4010"] = {
		["story"] = "<font>    音乐！夏日！祭典！音乐祭席卷弥赛亚，人们高唱着欢歌，共同享受这个快乐夏日。<br/>    如此欢庆的节日里，怎么少得了教会的参与，即使是平日端庄得体的祭司珊朵拉，也难以抵挡祭典的诱惑。<br/>    身姿随着音乐的节奏摆动，衣袖翻飞，泛着圣光的羽毛在身周飘落，仿佛天使也加入到舞蹈的队列中一般，珊朵拉瞬间成为了祭典中最瞩目的焦点。",
		["open_type"] = {
			["item"] = 9212,
		},
		["id"] = "4010",
		["cv_name"] = "花泽香菜",
		["voice_id"] = 2,
		["combo3_pos"] = {
			[1] = 171,
			[2] = -174,
		},
		["name"] = "祭舞风华",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 121,
			[2] = -282,
			[3] = 85,
		},
		["heroid"] = 10008,
	},
	["4003"] = {
		["story"] = "<font>    菲娅是史上最年轻的王座法师，几乎是努力天才的代名词的她，实际却曾有过可以走捷径的选项。<br/>    相传，在撒拉佛娜家族的书房中，封印着一本以恶魔语言所写的禁忌之书。恶魔语和龙语同样，属于奥罗拉世界的高等语言，那里有着魔法师所追求的强大之源，但哪怕只看一眼，代价也绝对不菲。<br/>    菲娅的志向非一般法师可比，她毫不犹豫地将书本付之一炬，随后一步步地攀登，最终凭自己的努力登上了顶峰。<br/>    如今回想起来，若然那时菲娅没有拒绝恶魔的邀请，结果又会如何？�<br/>    每当入梦，菲娅偶尔会看见端坐于孤峰之上，手握漆黑之炎的另一个自己。那是听从了恶魔耳语，偏离了魔道的堕落姿态，她全身散发着邪魅的气息，面对前来讨伐的天道宫一众，以毁灭的黑炎扫尽一切。<br/>    清晨，菲娅从噩梦中惊醒，她轻轻地抹去额头的汗水，却没有留意到，那弥留在她掌心的漆黑灼痕，和汗水一同被抹散。<br/></font>",
		["open_type"] = {
			["item"] = 9205,
		},
		["id"] = "4003",
		["cv_name"] = "川澄绫子",
		["voice_id"] = 39,
		["combo3_pos"] = {
			[1] = 205,
			[2] = -68,
			[3] = 75,
		},
		["name"] = "漆黑的真炎",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 163,
			[2] = -270,
			[3] = 80,
		},
		["heroid"] = 10002,
	},
	["4005"] = {
		["story"] = "<font>    在奥罗拉的隐世之地中，曾存在着一个名为龙王末裔的古老一族，其先祖是龙王与人族的混血儿，龙族衰亡后便在此世代守护着龙族的遗物，直至被魔族所发现。<br/>    大战后，魔族一直谋求着重新打开通往魔界的道路，而有着不可估测威能的龙族遗物，则是他们最后的希望。<br/>    面对魔族的入侵，族人们奋起抵抗，无奈龙王之血已然稀薄，无论人数还是实力都已不及魔族。<br/>    那一夜，屠戮的血光染尽了夜色，为了保留一丝火种，族长亲手将自己的女儿推落山谷，随后怆然倒地。<br/>    少女被推落到存放龙族遗物的禁地，身后紧随而来魔族陆续赶到，她却俨然不知，目光牢牢地锁在眼前的长枪上。“龙王的末裔啊，是时候解放你的真正姿态了。”苍老的声音在脑中回响，少女无言地执起长枪，一道金光从枪身流转至她体内，奔流的魔力随即卷起狂风。待风暴止息，少女的身姿已然发生变化，龙鳞的战甲覆盖着她的身躯，眼神苍茫而冰冷，视眼前的魔族如同死物。“屠戮殆尽吧，让这些低劣种族感受一下，龙族的愤怒。”<br/>    无数年后，已然长大的少女坐在窗边，双目依然保留着那一夜的冰冷，但随着身后敲门声响起，她熟练地戴上了眼镜，眼神瞬间柔和了下来。",
		["open_type"] = {
			["item"] = 9207,
		},
		["id"] = "4005",
		["cv_name"] = "今井麻美",
		["voice_id"] = 5,
		["combo3_pos"] = {
			[1] = 108,
			[2] = -152,
			[3] = 90,
		},
		["name"] = "龙王末裔",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 53,
			[2] = -233,
			[3] = 75,
		},
		["heroid"] = 10016,
	},
	["4007"] = {
		["story"] = "<font>    帝隆在魔法森林的遭遇，导致其丧失了体内所有的魔力，却在神秘老者点拨下，却俨然发现了一个崭新的世界。<br/>    “外法万千，天道归一。所谓魔法，不过是通往天道的殊途之一罢了。”明明体内的魔力空空如也，身体却前所未有的轻盈，将身心放空，宁静地感悟一番后，帝隆恍然大悟。魔力本就广泛地存在于天地之间，将视野局限于自身，不过是常人认知的误区。理解到这一点，帝隆一改曾经的修炼方式，变动为静，日复一日地在山巅静坐，凝神冥思。随着时间的流逝，渐渐地，山川、河流、树木、云翳……一切的一切都在帝隆的感悟间变得模糊起来，万物仿佛都失去了形态，变成了无法捕捉的魔力流动。<br/>    不知过去多久，帝隆突然睁开了双目，向着空无一物的眼前轻轻一抓，翻手展开，一簇火苗在他掌中慢慢升腾，身后的老者见此，露出了欣慰的笑容。<br/>    再没有指导的必要，老者留下了一套衣服作为别礼，便再无出现过，帝隆也决定再次踏上修行之路。<br/>    换上了全新的装束，帝隆来到了山巅，淡然地看着山下的崎岖道路，随即纵身一跃，脚下虚空中数个轻点，身影消失在群山云雾之中。",
		["open_type"] = {
			["item"] = 9209,
		},
		["id"] = "4007",
		["cv_name"] = "浅沼晋太郎",
		["voice_id"] = 12,
		["combo3_pos"] = {
			[1] = 272,
			[2] = -136,
		},
		["name"] = "炎拳宗师",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 210,
			[2] = -216,
			[3] = 80,
		},
		["hide"] = 1,
		["heroid"] = 10015,
	},
	["4012"] = {
		["story"] = "<font>    每年的圣诞夜，天使神殿都会派出一名天使作为使者，降临人间传播福音。<br/>    按照惯例，这名使者都会由天使长加百列担任，然而今年，某个身影却私自偷跑出神殿，抢先一步降临人间，担起了圣诞使者的职责。<br/>    “没错，今年的圣诞使者就是我米迦勒大人哒！”<br/>    这般宣称着，身穿圣诞装扮的米迦勒，开始以使者之名在奥罗拉展开巡游。<br/>    然而，完全没有搞清楚圣诞节为何物的她，以为跟万圣节的玩法差不多，满脑子都只想着如何给人造成惊吓。<br/>    “照耀吧！烈阳啊！给圣夜的大家一个大惊喜！”<br/>    就这样，在奥罗拉各地的夜空中，不时绽放出刺目的强光，将无数熟睡中的孩童惊醒，一时间村中鸡飞狗跳，乱作一团。<br/>    “嗯嗯，大家看起来都很高兴嘛，不愧是米迦勒大人。”<br/>    全然没有意识到自己做错了事，米迦勒一脸心满意足地飞向下一个村落，至于她最后是如何发现自己搞错了节日，羞得满脸通红，则是另一个故事了。",
		["open_type"] = {
			["item"] = 9214,
		},
		["id"] = "4012",
		["cv_name"] = "钉宫理惠",
		["voice_id"] = 58,
		["combo3_pos"] = {
			[1] = 76,
			[2] = -26,
			[3] = 90,
		},
		["name"] = "圣夜之光",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 45,
			[2] = -131,
			[3] = 70,
		},
		["heroid"] = 10039,
	},
	["4019"] = {
		["story"] = "<font>    所谓极冰，那是能够冻结一切的最强冰魔法，即便是以寒冰魔法一脉相传的福林兹家中，这也是一个如同禁语般的存在。<br/>    一旦对其心生渴望，便会将一切引向深渊，这是前人用生命总结出来的教训，谁也不会将这种声音置之度外。<br/>    艾丽西亚身为家族中被寄予厚望的长女，外表端庄贤淑，对戒条也恪守如一，更年纪轻轻便成为了王座法师的一席，在旁人眼中从来都是冷丽的高岭之花。<br/>    然而，实际上的艾丽西亚，却从不是那么高冷的人，她极度溺爱自己的妹妹，每当见到自己妹妹的时候，总是想努力维持住嘴角不要松弛已是极限。<br/>    这样的艾丽西亚，若看到最重要的妹妹在眼前受伤，会有怎么样的反应呢？<br/>    这是一段不存在于卡缇脑海中的记忆，那一年她参加了魔法学院举办的试炼，却迷失在试炼之森，被十多只野兽围攻，当艾丽西亚赶到之时，已经伤痕累累地倒下了。<br/>    所谓极冰，那是能够冻结一切的最强冰魔法，艾丽西亚只踏出一步，连同时间都像是被冻结了，那些飞扑到半空中的野兽全部失去了惯性自然坠落，摔成了一地的冰晶粉尘。<br/>    所谓极冰，需要不是对魔法的极高领悟，而是能够酝酿出那寂灭一切的杀意。然而，杀戮一旦开了头，前方便是万丈深渊，殊不知在怀抱着卡缇的艾丽西亚眼中，一丝凛冽的杀意闪烁而过，藏入了眼眸的深处。",
		["open_type"] = {
			["item"] = 9221,
		},
		["id"] = "4019",
		["cv_name"] = "牧野由依",
		["voice_id"] = 52,
		["combo3_pos"] = {
			[1] = 195,
			[2] = -150,
			[3] = 90,
		},
		["name"] = "极冰的深渊",
		["hero_type"] = 1,
		["combo2_pos"] = {
			[1] = 136,
			[2] = -250,
			[3] = 80,
		},
		["heroid"] = 10053,
	},
}

sskill_show = {
	[30081] = {
		["4016"] = {
			["combo2_show"] = 1030079,
			["skill_show"] = 1030079,
			["combo3_show"] = 1030079,
			["skill"] = 30081,
			["id"] = "4016",
		},
	},
	[30083] = {
		["4016"] = {
			["combo2_show"] = 1030079,
			["skill_show"] = 1030079,
			["combo3_show"] = 1030079,
			["skill"] = 30083,
			["id"] = "4016",
		},
	},
	[301501] = {
		["4003"] = {
			["combo2_show"] = 1030149,
			["skill_show"] = 1030149,
			["combo3_show"] = 1030149,
			["skill"] = 301501,
			["id"] = "4003",
		},
	},
	[30002] = {
		["4002"] = {
			["combo2_show"] = 10300021,
			["skill_show"] = 10300021,
			["combo3_show"] = 10300021,
			["skill"] = 30002,
			["id"] = "4002",
		},
	},
	[30004] = {
		["4002"] = {
			["combo2_show"] = 1030001,
			["skill_show"] = 1030001,
			["combo3_show"] = 1030001,
			["skill"] = 30004,
			["id"] = "4002",
		},
	},
	[30514] = {
		["4017"] = {
			["combo2_show"] = 1030513,
			["skill_show"] = 1030513,
			["combo3_show"] = 1030513,
			["skill"] = 30514,
			["id"] = "4017",
		},
	},
	[30516] = {
		["4017"] = {
			["combo2_show"] = 1030516,
			["skill_show"] = 1030516,
			["combo3_show"] = 1030516,
			["skill"] = 30516,
			["id"] = "4017",
		},
	},
	[30518] = {
		["4017"] = {
			["combo2_show"] = 1030516,
			["skill_show"] = 1030516,
			["combo3_show"] = 1030516,
			["skill"] = 30518,
			["id"] = "4017",
		},
	},
	[30520] = {
		["4017"] = {
			["combo2_show"] = 1030519,
			["skill_show"] = 1030519,
			["combo3_show"] = 1030519,
			["skill"] = 30520,
			["id"] = "4017",
		},
	},
	[30534] = {
		["4018"] = {
			["combo2_show"] = 1030533,
			["skill_show"] = 1030533,
			["combo3_show"] = 1030533,
			["skill"] = 30534,
			["id"] = "4018",
		},
	},
	[30536] = {
		["4018"] = {
			["combo2_show"] = 1030536,
			["skill_show"] = 1030536,
			["combo3_show"] = 1030536,
			["skill"] = 30536,
			["id"] = "4018",
		},
	},
	[30538] = {
		["4018"] = {
			["combo2_show"] = 1030536,
			["skill_show"] = 1030536,
			["combo3_show"] = 1030536,
			["skill"] = 30538,
			["id"] = "4018",
		},
	},
	[30540] = {
		["4018"] = {
			["combo2_show"] = 1030539,
			["skill_show"] = 1030539,
			["combo3_show"] = 1030539,
			["skill"] = 30540,
			["id"] = "4018",
		},
	},
	[30292] = {
		["4008"] = {
			["combo2_show"] = 1030204,
			["skill_show"] = 1030204,
			["combo3_show"] = 1030204,
			["skill"] = 30292,
			["id"] = "4008",
		},
	},
	[30421] = {
		["4012"] = {
			["combo2_show"] = 1030419,
			["skill_show"] = 1030419,
			["combo3_show"] = 1030419,
			["skill"] = 30421,
			["id"] = "4012",
		},
	},
	[30423] = {
		["4012"] = {
			["combo2_show"] = 1030419,
			["skill_show"] = 1030419,
			["combo3_show"] = 1030419,
			["skill"] = 30423,
			["id"] = "4012",
		},
	},
	[30425] = {
		["4012"] = {
			["combo2_show"] = 1030418,
			["skill_show"] = 1030418,
			["combo3_show"] = 1030418,
			["skill"] = 30425,
			["id"] = "4012",
		},
	},
	[30427] = {
		["4012"] = {
			["combo2_show"] = 1030417,
			["skill_show"] = 1030417,
			["combo3_show"] = 1030417,
			["skill"] = 30427,
			["id"] = "4012",
		},
	},
	[30429] = {
		["4012"] = {
			["combo2_show"] = 1030417,
			["skill_show"] = 1030417,
			["combo3_show"] = 1030417,
			["skill"] = 30429,
			["id"] = "4012",
		},
	},
	[30558] = {
		["4015"] = {
			["combo2_show"] = 1030556,
			["skill_show"] = 1030556,
			["combo3_show"] = 1030556,
			["skill"] = 30558,
			["id"] = "4015",
		},
	},
	[30564] = {
		["4019"] = {
			["combo2_show"] = 1030563,
			["skill_show"] = 1030563,
			["combo3_show"] = 1030563,
			["skill"] = 30564,
			["id"] = "4019",
		},
	},
	[30566] = {
		["4019"] = {
			["combo2_show"] = 1030566,
			["skill_show"] = 1030566,
			["combo3_show"] = 1030566,
			["skill"] = 30566,
			["id"] = "4019",
		},
	},
	[30568] = {
		["4019"] = {
			["combo2_show"] = 1030566,
			["skill_show"] = 1030566,
			["combo3_show"] = 1030566,
			["skill"] = 30568,
			["id"] = "4019",
		},
	},
	[30570] = {
		["4019"] = {
			["combo2_show"] = 1030569,
			["skill_show"] = 1030569,
			["combo3_show"] = 1030569,
			["skill"] = 30570,
			["id"] = "4019",
		},
	},
	[301511] = {
		["4003"] = {
			["combo2_show"] = 1030149,
			["skill_show"] = 1030149,
			["combo3_show"] = 1030149,
			["skill"] = 301511,
			["id"] = "4003",
		},
	},
	[30082] = {
		["4016"] = {
			["combo2_show"] = 1030079,
			["skill_show"] = 1030079,
			["combo3_show"] = 1030079,
			["skill"] = 30082,
			["id"] = "4016",
		},
	},
	[303861] = {
		["4038"] = {
			["combo2_show"] = 1000005,
			["skill_show"] = 1000005,
			["combo3_show"] = 1000005,
			["skill"] = 303861,
			["id"] = "4038",
		},
	},
	[301491] = {
		["4003"] = {
			["combo2_show"] = 1030149,
			["skill_show"] = 1030149,
			["combo3_show"] = 1030149,
			["skill"] = 301491,
			["id"] = "4003",
		},
	},
	[30001] = {
		["4002"] = {
			["combo2_show"] = 1030001,
			["skill_show"] = 1030001,
			["combo3_show"] = 1030001,
			["skill"] = 30001,
			["id"] = "4002",
		},
	},
	[30003] = {
		["4002"] = {
			["combo2_show"] = 10300031,
			["skill_show"] = 10300031,
			["combo3_show"] = 10300031,
			["skill"] = 30003,
			["id"] = "4002",
		},
	},
	[30513] = {
		["4017"] = {
			["combo2_show"] = 1030513,
			["skill_show"] = 1030513,
			["combo3_show"] = 1030513,
			["skill"] = 30513,
			["id"] = "4017",
		},
	},
	[30515] = {
		["4017"] = {
			["combo2_show"] = 1030513,
			["skill_show"] = 1030513,
			["combo3_show"] = 1030513,
			["skill"] = 30515,
			["id"] = "4017",
		},
	},
	[30517] = {
		["4017"] = {
			["combo2_show"] = 1030516,
			["skill_show"] = 1030516,
			["combo3_show"] = 1030516,
			["skill"] = 30517,
			["id"] = "4017",
		},
	},
	[30519] = {
		["4017"] = {
			["combo2_show"] = 1030519,
			["skill_show"] = 1030519,
			["combo3_show"] = 1030519,
			["skill"] = 30519,
			["id"] = "4017",
		},
	},
	[30521] = {
		["4017"] = {
			["combo2_show"] = 1030519,
			["skill_show"] = 1030519,
			["combo3_show"] = 1030519,
			["skill"] = 30521,
			["id"] = "4017",
		},
	},
	[300632] = {
		["4004"] = {
			["combo2_show"] = 10300602,
			["skill_show"] = 10300602,
			["combo3_show"] = 10300602,
			["skill"] = 300632,
			["id"] = "4004",
		},
	},
	[30005] = {
		["4002"] = {
			["combo2_show"] = 10300022,
			["skill_show"] = 10300022,
			["combo3_show"] = 10300022,
			["skill"] = 30005,
			["id"] = "4002",
		},
	},
	[300662] = {
		["4004"] = {
			["combo2_show"] = 10300602,
			["skill_show"] = 10300602,
			["combo3_show"] = 10300602,
			["skill"] = 300662,
			["id"] = "4004",
		},
	},
	[30006] = {
		["4002"] = {
			["combo2_show"] = 10300032,
			["skill_show"] = 10300032,
			["combo3_show"] = 10300032,
			["skill"] = 30006,
			["id"] = "4002",
		},
	},
	[30007] = {
		["4002"] = {
			["combo2_show"] = 1030001,
			["skill_show"] = 1030001,
			["combo3_show"] = 1030001,
			["skill"] = 30007,
			["id"] = "4002",
		},
	},
	[30533] = {
		["4018"] = {
			["combo2_show"] = 1030533,
			["skill_show"] = 1030533,
			["combo3_show"] = 1030533,
			["skill"] = 30533,
			["id"] = "4018",
		},
	},
	[30535] = {
		["4018"] = {
			["combo2_show"] = 1030533,
			["skill_show"] = 1030533,
			["combo3_show"] = 1030533,
			["skill"] = 30535,
			["id"] = "4018",
		},
	},
	[30537] = {
		["4018"] = {
			["combo2_show"] = 1030536,
			["skill_show"] = 1030536,
			["combo3_show"] = 1030536,
			["skill"] = 30537,
			["id"] = "4018",
		},
	},
	[30539] = {
		["4018"] = {
			["combo2_show"] = 1030539,
			["skill_show"] = 1030539,
			["combo3_show"] = 1030539,
			["skill"] = 30539,
			["id"] = "4018",
		},
	},
	[30541] = {
		["4018"] = {
			["combo2_show"] = 1030539,
			["skill_show"] = 1030539,
			["combo3_show"] = 1030539,
			["skill"] = 30541,
			["id"] = "4018",
		},
	},
	[30008] = {
		["4002"] = {
			["combo2_show"] = 10300022,
			["skill_show"] = 10300022,
			["combo3_show"] = 10300022,
			["skill"] = 30008,
			["id"] = "4002",
		},
	},
	[30291] = {
		["4008"] = {
			["combo2_show"] = 1030204,
			["skill_show"] = 1030204,
			["combo3_show"] = 1030204,
			["skill"] = 30291,
			["id"] = "4008",
		},
	},
	[30293] = {
		["4008"] = {
			["combo2_show"] = 1030204,
			["skill_show"] = 1030204,
			["combo3_show"] = 1030204,
			["skill"] = 30293,
			["id"] = "4008",
		},
	},
	[30422] = {
		["4012"] = {
			["combo2_show"] = 1030419,
			["skill_show"] = 1030419,
			["combo3_show"] = 1030419,
			["skill"] = 30422,
			["id"] = "4012",
		},
	},
	[30424] = {
		["4012"] = {
			["combo2_show"] = 1030418,
			["skill_show"] = 1030418,
			["combo3_show"] = 1030418,
			["skill"] = 30424,
			["id"] = "4012",
		},
	},
	[30426] = {
		["4012"] = {
			["combo2_show"] = 1030418,
			["skill_show"] = 1030418,
			["combo3_show"] = 1030418,
			["skill"] = 30426,
			["id"] = "4012",
		},
	},
	[300602] = {
		["4004"] = {
			["combo2_show"] = 10300602,
			["skill_show"] = 10300602,
			["combo3_show"] = 10300602,
			["skill"] = 300602,
			["id"] = "4004",
		},
	},
	[30557] = {
		["4015"] = {
			["combo2_show"] = 1030556,
			["skill_show"] = 1030556,
			["combo3_show"] = 1030556,
			["skill"] = 30557,
			["id"] = "4015",
		},
	},
	[30009] = {
		["4002"] = {
			["combo2_show"] = 10300032,
			["skill_show"] = 10300032,
			["combo3_show"] = 10300032,
			["skill"] = 30009,
			["id"] = "4002",
		},
	},
	[30157] = {
		["4003"] = {
			["combo2_show"] = 1030155,
			["skill_show"] = 1030155,
			["combo3_show"] = 1030155,
			["skill"] = 30157,
			["id"] = "4003",
		},
	},
	[30563] = {
		["4019"] = {
			["combo2_show"] = 1030563,
			["skill_show"] = 1030563,
			["combo3_show"] = 1030563,
			["skill"] = 30563,
			["id"] = "4019",
		},
	},
	[30565] = {
		["4019"] = {
			["combo2_show"] = 1030563,
			["skill_show"] = 1030563,
			["combo3_show"] = 1030563,
			["skill"] = 30565,
			["id"] = "4019",
		},
	},
	[30567] = {
		["4019"] = {
			["combo2_show"] = 1030566,
			["skill_show"] = 1030566,
			["combo3_show"] = 1030566,
			["skill"] = 30567,
			["id"] = "4019",
		},
	},
	[30569] = {
		["4019"] = {
			["combo2_show"] = 1030569,
			["skill_show"] = 1030569,
			["combo3_show"] = 1030569,
			["skill"] = 30569,
			["id"] = "4019",
		},
	},
	[30571] = {
		["4019"] = {
			["combo2_show"] = 1030569,
			["skill_show"] = 1030569,
			["combo3_show"] = 1030569,
			["skill"] = 30571,
			["id"] = "4019",
		},
	},
	[30556] = {
		["4015"] = {
			["combo2_show"] = 1030556,
			["skill_show"] = 1030556,
			["combo3_show"] = 1030556,
			["skill"] = 30556,
			["id"] = "4015",
		},
	},
	[30152] = {
		["4003"] = {
			["combo2_show"] = 1030152,
			["skill_show"] = 1030152,
			["combo3_show"] = 1030152,
			["skill"] = 30152,
			["id"] = "4003",
		},
	},
	[30153] = {
		["4003"] = {
			["combo2_show"] = 1030152,
			["skill_show"] = 1030152,
			["combo3_show"] = 1030152,
			["skill"] = 30153,
			["id"] = "4003",
		},
	},
	[30154] = {
		["4003"] = {
			["combo2_show"] = 1030152,
			["skill_show"] = 1030152,
			["combo3_show"] = 1030152,
			["skill"] = 30154,
			["id"] = "4003",
		},
	},
	[30155] = {
		["4003"] = {
			["combo2_show"] = 1030155,
			["skill_show"] = 1030155,
			["combo3_show"] = 1030155,
			["skill"] = 30155,
			["id"] = "4003",
		},
	},
	[30156] = {
		["4003"] = {
			["combo2_show"] = 1030155,
			["skill_show"] = 1030155,
			["combo3_show"] = 1030155,
			["skill"] = 30156,
			["id"] = "4003",
		},
	},
	[30077] = {
		["4016"] = {
			["combo2_show"] = 10300771,
			["skill_show"] = 10300771,
			["combo3_show"] = 10300771,
			["skill"] = 30077,
			["id"] = "4016",
		},
	},
	[30428] = {
		["4012"] = {
			["combo2_show"] = 1030417,
			["skill_show"] = 1030417,
			["combo3_show"] = 1030417,
			["skill"] = 30428,
			["id"] = "4012",
		},
	},
}

kanbanskin = {
	["1007"] = {
		["id"] = "1007",
		["role_res"] = "res/image/anim/other/tokupcg/tokupcg",
		["location_conf"] = {
			["1"] = {
				[1] = 464,
				[2] = 394,
				[3] = 0.75,
				[4] = 1,
			},
			["3"] = {
				[1] = 147,
				[2] = -190,
				[3] = 1,
				[4] = 1,
			},
			["2"] = {
				[1] = 586,
				[2] = 335,
				[3] = 0.8,
				[4] = 1,
			},
		},
	},
	["1008"] = {
		["id"] = "1008",
		["role_res"] = "res/image/anim/other/michaelcg_skin01/michaelcg_skin01",
		["location_conf"] = {
			["1"] = {
				[1] = 424,
				[2] = 500,
				[3] = 0.75,
				[4] = 1,
			},
			["3"] = {
				[1] = 150,
				[2] = -43,
				[3] = 1,
				[4] = 1,
			},
			["2"] = {
				[1] = 586,
				[2] = 415,
				[3] = 0.8,
				[4] = 1,
			},
		},
	},
	["1004"] = {
		["id"] = "1004",
		["role_res"] = "res/image/anim/other/217cg/217cg",
		["location_conf"] = {
			["1"] = {
				[1] = 464,
				[2] = 480,
				[3] = 0.75,
				[4] = 1,
			},
			["3"] = {
				[1] = 147,
				[2] = -60,
				[3] = 1,
				[4] = 1,
			},
			["2"] = {
				[1] = 586,
				[2] = 463,
				[3] = 0.8,
				[4] = 1,
			},
		},
	},
	["1005"] = {
		["id"] = "1005",
		["role_res"] = "res/image/anim/other/miumecg/miumecg",
		["location_conf"] = {
			["1"] = {
				[1] = 464,
				[2] = 457,
				[3] = 0.8,
				[4] = 1,
			},
			["3"] = {
				[1] = 147,
				[2] = -75,
				[3] = 1,
				[4] = 1,
			},
			["2"] = {
				[1] = 586,
				[2] = 423,
				[3] = 0.8,
				[4] = 1,
			},
		},
	},
	["1001"] = {
		["id"] = "1001",
		["role_res"] = "res/image/anim/other/opheliacg/opheliacg",
		["location_conf"] = {
			["1"] = {
				[1] = 464,
				[2] = 534,
				[3] = 0.85,
				[4] = 1,
			},
			["3"] = {
				[1] = 133,
				[2] = -120,
				[3] = 1.15,
				[4] = 1,
			},
			["2"] = {
				[1] = 586,
				[2] = 463,
				[3] = 0.9,
				[4] = 1,
			},
		},
	},
	["1003"] = {
		["id"] = "1003",
		["role_res"] = "res/image/anim/other/michaelcg/michaelcg",
		["location_conf"] = {
			["1"] = {
				[1] = 464,
				[2] = 534,
				[3] = 0.75,
				[4] = 1,
			},
			["3"] = {
				[1] = 147,
				[2] = 15,
				[3] = 1,
				[4] = 1,
			},
			["2"] = {
				[1] = 586,
				[2] = 463,
				[3] = 0.8,
				[4] = 1,
			},
		},
	},
	["1006"] = {
		["id"] = "1006",
		["role_res"] = "res/image/anim/other/mariacg/mariacg",
		["location_conf"] = {
			["1"] = {
				[1] = 464,
				[2] = 440,
				[3] = 0.75,
				[4] = 1,
			},
			["3"] = {
				[1] = 147,
				[2] = -120,
				[3] = 1,
				[4] = 1,
			},
			["2"] = {
				[1] = 586,
				[2] = 393,
				[3] = 0.8,
				[4] = 1,
			},
		},
	},
	["1002"] = {
		["id"] = "1002",
		["role_res"] = "res/image/anim/other/luotianyicg/luotianyicg",
		["location_conf"] = {
			["1"] = {
				[1] = 464,
				[2] = 534,
				[3] = 0.75,
				[4] = 1,
			},
			["3"] = {
				[1] = 133,
				[2] = -120,
				[3] = 1,
				[4] = -1,
			},
			["2"] = {
				[1] = 586,
				[2] = 463,
				[3] = 0.8,
				[4] = 1,
			},
		},
	},
}

seffect_show = {
	[305686] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 305686,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[3051914] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 3051914,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[3003402] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003402,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003404] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003404,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003406] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003406,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003408] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003408,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003410] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003410,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003412] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003412,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003414] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003414,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003401] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003401,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003403] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003403,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003405] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003405,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003407] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003407,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003409] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003409,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003411] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003411,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003413] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003413,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003415] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003415,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003417] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003417,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[3003419] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003419,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[300992] = {
		["4009"] = {
			["show"] = 262,
			["effect"] = 300992,
			["id"] = "4009",
			["combo3_show"] = 262,
			["combo2_show"] = 262,
		},
	},
	[301501] = {
		["4003"] = {
			["show"] = 201,
			["effect"] = 301501,
			["id"] = "4003",
			["combo3_show"] = 201,
			["combo2_show"] = 201,
		},
	},
	[300201] = {
		["4001"] = {
			["show"] = 187,
			["effect"] = 300201,
			["id"] = "4001",
			["combo3_show"] = 187,
			["combo2_show"] = 187,
		},
	},
	[30149] = {
		["4003"] = {
			["show"] = 202,
			["effect"] = 30149,
			["id"] = "4003",
			["combo3_show"] = 202,
			["combo2_show"] = 202,
		},
	},
	[30151] = {
		["4003"] = {
			["show"] = 202,
			["effect"] = 30151,
			["id"] = "4003",
			["combo3_show"] = 202,
			["combo2_show"] = 202,
		},
	},
	[30153] = {
		["4003"] = {
			["show"] = 203,
			["effect"] = 30153,
			["id"] = "4003",
			["combo3_show"] = 203,
			["combo2_show"] = 203,
		},
	},
	[302711] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 302711,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[302712] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 302712,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[30292] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 30292,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[302713] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 302713,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[30554] = {
		["4015"] = {
			["show"] = 294,
			["effect"] = 30554,
			["id"] = "4015",
			["combo3_show"] = 294,
			["combo2_show"] = 294,
		},
	},
	[305667] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 305667,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[30058] = {
		["4004"] = {
			["show"] = 205,
			["effect"] = 30058,
			["id"] = "4004",
			["combo3_show"] = 205,
			["combo2_show"] = 205,
		},
	},
	[305160] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 305160,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[30064] = {
		["4004"] = {
			["show"] = 205,
			["effect"] = 30064,
			["id"] = "4004",
			["combo3_show"] = 205,
			["combo2_show"] = 205,
		},
	},
	[3052011] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 3052011,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[3052021] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 3052021,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[301511] = {
		["4003"] = {
			["show"] = 201,
			["effect"] = 301511,
			["id"] = "4003",
			["combo3_show"] = 201,
			["combo2_show"] = 201,
		},
	},
	[80002] = {
		["4019"] = {
			["show"] = 331,
			["effect"] = 80002,
			["id"] = "4019",
			["combo3_show"] = 331,
			["combo2_show"] = 331,
		},
	},
	[300972] = {
		["4009"] = {
			["show"] = 262,
			["effect"] = 300972,
			["id"] = "4009",
			["combo3_show"] = 262,
			["combo2_show"] = 262,
		},
	},
	[3052031] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 3052031,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[950616] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 950616,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[3051915] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 3051915,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[3051916] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 3051916,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[3056611] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 3056611,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[300982] = {
		["4009"] = {
			["show"] = 262,
			["effect"] = 300982,
			["id"] = "4009",
			["combo3_show"] = 262,
			["combo2_show"] = 262,
		},
	},
	[950612] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 950612,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[950611] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 950611,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[6011631] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 6011631,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[6011621] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 6011621,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[302721] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 302721,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[300231] = {
		["4001"] = {
			["show"] = 187,
			["effect"] = 300231,
			["id"] = "4001",
			["combo3_show"] = 187,
			["combo2_show"] = 187,
		},
	},
	[30571] = {
		["4019"] = {
			["show"] = 330,
			["effect"] = 30571,
			["id"] = "4019",
			["combo3_show"] = 330,
			["combo2_show"] = 330,
		},
	},
	[30570] = {
		["4019"] = {
			["show"] = 330,
			["effect"] = 30570,
			["id"] = "4019",
			["combo3_show"] = 330,
			["combo2_show"] = 330,
		},
	},
	[302722] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 302722,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[300341] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 300341,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[30569] = {
		["4019"] = {
			["show"] = 330,
			["effect"] = 30569,
			["id"] = "4019",
			["combo3_show"] = 330,
			["combo2_show"] = 330,
		},
	},
	[305687] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 305687,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[302723] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 302723,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[305676] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 305676,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[3003420] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003420,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[305666] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 305666,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[305675] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 305675,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[305677] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 305677,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[305201] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 305201,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[305665] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 305665,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[30533] = {
		["4018"] = {
			["show"] = 322,
			["effect"] = 30533,
			["id"] = "4018",
			["combo3_show"] = 322,
			["combo2_show"] = 322,
		},
	},
	[305390] = {
		["4018"] = {
			["show"] = 321,
			["effect"] = 305390,
			["id"] = "4018",
			["combo3_show"] = 321,
			["combo2_show"] = 321,
		},
	},
	[305202] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 305202,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[305194] = {
		["4017"] = {
			["show"] = 320,
			["effect"] = 305194,
			["id"] = "4017",
			["combo3_show"] = 320,
			["combo2_show"] = 320,
		},
	},
	[305134] = {
		["4017"] = {
			["show"] = 319,
			["effect"] = 305134,
			["id"] = "4017",
			["combo3_show"] = 319,
			["combo2_show"] = 319,
		},
	},
	[30150] = {
		["4003"] = {
			["show"] = 202,
			["effect"] = 30150,
			["id"] = "4003",
			["combo3_show"] = 202,
			["combo2_show"] = 202,
		},
	},
	[30152] = {
		["4003"] = {
			["show"] = 203,
			["effect"] = 30152,
			["id"] = "4003",
			["combo3_show"] = 203,
			["combo2_show"] = 203,
		},
	},
	[30154] = {
		["4003"] = {
			["show"] = 203,
			["effect"] = 30154,
			["id"] = "4003",
			["combo3_show"] = 203,
			["combo2_show"] = 203,
		},
	},
	[300949] = {
		["4009"] = {
			["show"] = 263,
			["effect"] = 300949,
			["id"] = "4009",
			["combo3_show"] = 263,
			["combo2_show"] = 263,
		},
	},
	[30520312] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 30520312,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[3003418] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003418,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[305203] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 305203,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[30291] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 30291,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[30293] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 30293,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[3051603] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 3051603,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[30520112] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 30520112,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[30553] = {
		["4015"] = {
			["show"] = 294,
			["effect"] = 30553,
			["id"] = "4015",
			["combo3_show"] = 294,
			["combo2_show"] = 294,
		},
	},
	[301491] = {
		["4003"] = {
			["show"] = 201,
			["effect"] = 301491,
			["id"] = "4003",
			["combo3_show"] = 201,
			["combo2_show"] = 201,
		},
	},
	[950613] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 950613,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[30559] = {
		["4015"] = {
			["show"] = 295,
			["effect"] = 30559,
			["id"] = "4015",
			["combo3_show"] = 295,
			["combo2_show"] = 295,
		},
	},
	[950614] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 950614,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[302731] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 302731,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[950615] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 950615,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[300261] = {
		["4001"] = {
			["show"] = 187,
			["effect"] = 300261,
			["id"] = "4001",
			["combo3_show"] = 187,
			["combo2_show"] = 187,
		},
	},
	[30061] = {
		["4004"] = {
			["show"] = 205,
			["effect"] = 30061,
			["id"] = "4004",
			["combo3_show"] = 205,
			["combo2_show"] = 205,
		},
	},
	[30520212] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 30520212,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[30555] = {
		["4015"] = {
			["show"] = 294,
			["effect"] = 30555,
			["id"] = "4015",
			["combo3_show"] = 294,
			["combo2_show"] = 294,
		},
	},
	[6011611] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 6011611,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[302732] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 302732,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[305685] = {
		["4019"] = {
			["show"] = 329,
			["effect"] = 305685,
			["id"] = "4019",
			["combo3_show"] = 329,
			["combo2_show"] = 329,
		},
	},
	[3051602] = {
		["4017"] = {
			["show"] = 318,
			["effect"] = 3051602,
			["id"] = "4017",
			["combo3_show"] = 318,
			["combo2_show"] = 318,
		},
	},
	[3003416] = {
		["4014"] = {
			["show"] = 289,
			["effect"] = 3003416,
			["id"] = "4014",
			["combo3_show"] = 289,
			["combo2_show"] = 289,
		},
	},
	[302733] = {
		["4008"] = {
			["show"] = 232,
			["effect"] = 302733,
			["id"] = "4008",
			["combo3_show"] = 232,
			["combo2_show"] = 232,
		},
	},
	[10016] = {
		["4003"] = {
			["show"] = 204,
			["effect"] = 10016,
			["id"] = "4003",
			["combo3_show"] = 204,
			["combo2_show"] = 204,
		},
	},
}

pet = {
	["1010"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 1026,
			[3] = 1,
		},
		["roleskin_id"] = 3012,
		["name"] = "足球猫头鹰",
		["open_type"] = {
			["item"] = 9109,
		},
		["id"] = "1010",
		["pose_val"] = {
			[1] = -20,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_tap2.png",
		["hide"] = 1,
	},
	["1005"] = {
		["size_pose"] = {
			[1] = 138,
			[2] = 984,
			[3] = 1,
		},
		["roleskin_id"] = 3007,
		["name"] = "腾讯企鹅",
		["open_type"] = {
			["item"] = 9104,
		},
		["id"] = "1005",
		["pose_val"] = {
			[1] = -20,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_qie.png",
		["hide"] = 1,
	},
	["1006"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 1007,
			[3] = 1,
		},
		["roleskin_id"] = 3008,
		["name"] = "OPPO蝴蝶",
		["open_type"] = {
			["item"] = 9105,
		},
		["id"] = "1006",
		["pose_val"] = {
			[1] = -35,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_oppo.png",
		["hide"] = 1,
	},
	["1003"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 984,
			[3] = 1,
		},
		["roleskin_id"] = 3005,
		["name"] = "TAP猫头鹰",
		["open_type"] = {
			["item"] = 9102,
		},
		["id"] = "1003",
		["pose_val"] = {
			[1] = -20,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_tap.png",
		["hide"] = 1,
	},
	["1014"] = {
		["size_pose"] = {
			[1] = 90,
			[2] = 1026,
			[3] = 1,
		},
		["roleskin_id"] = 3017,
		["name"] = "小美",
		["open_type"] = {
			["item"] = 9113,
		},
		["id"] = "1014",
		["pose_val"] = {
			[1] = -20,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_xy.png",
		["hide"] = 0,
	},
	["1001"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 964,
			[3] = 1,
		},
		["roleskin_id"] = 3001,
		["name"] = "冒险兔",
		["open_type"] = {
			["default"] = 1,
		},
		["id"] = "1001",
		["pose_val"] = {
			[1] = 0,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_tz.png",
		["hide"] = 0,
	},
	["1007"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 1001,
			[3] = 1,
		},
		["roleskin_id"] = 3009,
		["name"] = "小VV",
		["open_type"] = {
			["item"] = 9106,
		},
		["id"] = "1007",
		["pose_val"] = {
			[1] = -30,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_vivo.png",
		["hide"] = 1,
	},
	["1012"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 1026,
			[3] = 1,
		},
		["roleskin_id"] = 3015,
		["name"] = "吉祥猪嘟嘟",
		["open_type"] = {
			["item"] = 9111,
		},
		["id"] = "1012",
		["pose_val"] = {
			[1] = -10,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_pig.png",
		["hide"] = 0,
	},
	["1004"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 984,
			[3] = 1,
		},
		["roleskin_id"] = 3006,
		["name"] = "萌狮王",
		["open_type"] = {
			["item"] = 9103,
		},
		["id"] = "1004",
		["pose_val"] = {
			[1] = -20,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_hwsz.png",
		["hide"] = 1,
	},
	["1011"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 1026,
			[3] = 1,
		},
		["roleskin_id"] = 3013,
		["name"] = "无畏骑士兔",
		["open_type"] = {
			["item"] = 9110,
		},
		["id"] = "1011",
		["pose_val"] = {
			[1] = -10,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_tz2.png",
		["hide"] = 1,
	},
	["1013"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 1026,
			[3] = 1,
		},
		["roleskin_id"] = 3016,
		["name"] = "小红莲",
		["open_type"] = {
			["item"] = 9112,
		},
		["id"] = "1013",
		["pose_val"] = {
			[1] = -10,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_znq.png",
		["hide"] = 0,
	},
	["1008"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 1026,
			[3] = 1,
		},
		["roleskin_id"] = 3010,
		["name"] = "麒麟酱",
		["open_type"] = {
			["item"] = 9107,
		},
		["id"] = "1008",
		["pose_val"] = {
			[1] = -55,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_hwsz2.png",
		["hide"] = 1,
	},
	["1009"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 1026,
			[3] = 1,
		},
		["roleskin_id"] = 3011,
		["name"] = "足球宝贝",
		["open_type"] = {
			["item"] = 9108,
		},
		["id"] = "1009",
		["pose_val"] = {
			[1] = -55,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_hwsz3.png",
		["hide"] = 1,
	},
	["1002"] = {
		["size_pose"] = {
			[1] = 158,
			[2] = 1024,
			[3] = 1,
		},
		["roleskin_id"] = 3004,
		["name"] = "天钿",
		["open_type"] = {
			["item"] = 9101,
		},
		["id"] = "1002",
		["pose_val"] = {
			[1] = -20,
			[2] = 0,
		},
		["pet_drawing"] = "res/image/ui/00/08_pic_td.png",
		["hide"] = 0,
	},
}

kanbanrole = {
	["1004"] = {
		["shop"] = {
		},
		["name"] = "GARNiDELiA",
		["open_type"] = {
			["item"] = 9003,
		},
		["id"] = "1004",
		["skins"] = {
			[1] = "1004",
			[2] = "1005",
			[3] = "1006",
			[4] = "1007",
		},
		["head_res"] = "res/image/ui/07_head/07_pic_168.png",
		["mission"] = {
		},
	},
	["1005"] = {
		["shop"] = {
		},
		["name"] = "MARiA",
		["open_type"] = {
			["item"] = 9004,
		},
		["id"] = "1005",
		["skins"] = {
			[1] = "1006",
		},
		["head_res"] = "res/image/ui/07_head/07_pic_165.png",
		["mission"] = {
		},
	},
	["1001"] = {
		["shop"] = {
			[1] = "res/audio/cv/ui/shop/01",
			[2] = "res/audio/cv/ui/shop/02",
			[3] = "res/audio/cv/ui/shop/03",
		},
		["name"] = "奥菲利亚",
		["open_type"] = {
			["default"] = 1,
		},
		["id"] = "1001",
		["skins"] = {
			[1] = "1001",
		},
		["head_res"] = "res/image/ui/07_head/07_pic_07.png",
		["mission"] = {
			[1] = "res/audio/cv/ui/adventure/01",
			[2] = "res/audio/cv/ui/adventure/02",
			[3] = "res/audio/cv/ui/adventure/03",
		},
	},
	["1003"] = {
		["shop"] = {
			[1] = "res/audio/cv/michael/024",
			[2] = "res/audio/cv/michael/025",
			[3] = "res/audio/cv/michael/026",
		},
		["name"] = "米迦勒",
		["open_type"] = {
			["item"] = 9002,
		},
		["id"] = "1003",
		["skins"] = {
			[1] = "1003",
		},
		["head_res"] = "res/image/ui/07_head/07_pic_109.png",
		["mission"] = {
			[1] = "res/audio/cv/michael/014",
			[2] = "res/audio/cv/michael/021",
			[3] = "res/audio/cv/michael/022",
		},
	},
	["1006"] = {
		["shop"] = {
			[1] = "res/audio/cv/stmichael/019",
			[2] = "res/audio/cv/stmichael/020",
			[3] = "res/audio/cv/stmichael/021",
		},
		["name"] = "圣夜之光",
		["open_type"] = {
			["item"] = 9005,
		},
		["id"] = "1006",
		["skins"] = {
			[1] = "1008",
		},
		["head_res"] = "res/image/ui/07_head/07_pic_176.png",
		["mission"] = {
			[1] = "res/audio/cv/stmichael/022",
			[2] = "res/audio/cv/stmichael/023",
			[3] = "res/audio/cv/stmichael/024",
		},
	},
	["1002"] = {
		["shop"] = {
			[1] = "res/audio/cv/luotianyi/019",
			[2] = "res/audio/cv/luotianyi/020",
			[3] = "res/audio/cv/luotianyi/021",
		},
		["name"] = "洛天依",
		["open_type"] = {
			["item"] = 9001,
		},
		["id"] = "1002",
		["skins"] = {
			[1] = "1002",
		},
		["head_res"] = "res/image/ui/07_head/07_pic_97.png",
		["mission"] = {
			[1] = "res/audio/cv/luotianyi/EX002",
			[2] = "res/audio/cv/luotianyi/EX003",
		},
	},
}



